Vorlesung/ParProg-Multithreading.org
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Multithreading
#+SUBTITLE: Parallelprogrammierung
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:true
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
# +REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t
# um Folien mit reveal.js erzeugen zu können:ml
# M-x load-library und dann ox-reveal

* Multithreading -- Grundlagen
#   Chapter 5 : WICHTIG !!! (Java)
** Overview
# chapter 5: multithreadingOverview.txt
+ The chief advantage of multithreading over multiprocessing is that
  threads are /lighter/ than processes:
  + A process consists of one or more threads of execution.
  + A process-level context switch is significantly more expensive, in the millisecond range.
  + A thread-level context switch has a near-zero cost for threads in
    the same process.
+ The chief disadvantage is that threads in the same process share the
  same address space:
  + The programmer, rather than the OS, must ensure that two threads
    in the same process don't inappropriately access the same memory
    location (e.g., by trying to update the location).
  + The programmer must coordinate threads in the same process to
    avoid /race conditions/.  
    + If the coordination is overdone, /deadlock/ may result.
  + Thread coordination must be just right:
    + Too little brings the threat of race conditions and, therefore,
      unpredictable results.
    + Too much hurts efficiency and may result in deadlock.
+ Some systems (e.g., Linux) implement threads as processes that
  happen to share an address space; other systems (e.g., Windows) have
  distinct kernel-level support for threads.
  + Under any implementation, the standard behavior is that distinct
    processes have distinct address spaces, whereas threads in the
    same process share an address space.
+ Examples in C, Java, and Go
  + C# and Java have very similar support for threading, although both
    sides might disagree with this characterization.
** A Sample Race Condition in Java
