Vorlesung/ParProg-Multithreading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-11-01 Wed 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multithreading</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Multithreading
<br />
<span class="subtitle">Parallelprogrammierung</span>
</h1>

<div id="outline-container-org76cd844" class="outline-2">
<h2 id="org76cd844">Multithreading &#x2013; Grundlagen</h2>
<div class="outline-text-2" id="text-org76cd844">
</div>
<div id="outline-container-org6ac4d43" class="outline-3">
<h3 id="org6ac4d43">Overview</h3>
<div class="outline-text-3" id="text-org6ac4d43">
<ul class="org-ul">
<li>The chief advantage of multithreading over multiprocessing is that
threads are <i>lighter</i> than processes:
<ul class="org-ul">
<li>A process consists of one or more threads of execution.</li>
<li>A process-level context switch is significantly more expensive, in the millisecond range.</li>
<li>A thread-level context switch has a near-zero cost for threads in
the same process.</li>
</ul></li>
<li>The chief disadvantage is that threads in the same process share the
same address space:
<ul class="org-ul">
<li>The programmer, rather than the OS, must ensure that two threads
in the same process don't inappropriately access the same memory
location (e.g., by trying to update the location).</li>
<li>The programmer must coordinate threads in the same process to
avoid <i>race conditions</i>.  
<ul class="org-ul">
<li>If the coordination is overdone, <i>deadlock</i> may result.</li>
</ul></li>
<li>Thread coordination must be just right:
<ul class="org-ul">
<li>Too little brings the threat of race conditions and, therefore,
unpredictable results.</li>
<li>Too much hurts efficiency and may result in deadlock.</li>
</ul></li>
</ul></li>
<li>Some systems (e.g., Linux) implement threads as processes that
happen to share an address space; other systems (e.g., Windows) have
distinct kernel-level support for threads.
<ul class="org-ul">
<li>Under any implementation, the standard behavior is that distinct
processes have distinct address spaces, whereas threads in the
same process share an address space.</li>
</ul></li>
<li>Examples in C, Java, and Go
<ul class="org-ul">
<li>C# and Java have very similar support for threading, although both
sides might disagree with this characterization.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org46236cd" class="outline-3">
<h3 id="org46236cd">A Sample Race Condition in Java</h3>
