Vorlesung/ParProg-Multithreading.org
** Analysis of the Race Condition Code
# chapter 5: raceConditionanalysis.txt
 A detailed look at how a race condition occurs

+ T1 and T2 are threads in process P: T1 and T2 have access the same
  memory locations.
+ N is memory location within the address space that T1 and T2 share
+ T1 tries to increment n at the same time that T2 tries to
  decrement N.
  #+begin_example
      N = N + 1  +---+  N = N - 1        ## Are these statements 'atomic'?
   T1----------->| 5 |<-----------T2
	         +---+
	           N
  #+end_example
+ Each pseudo-code instruction involves two operations: an addition or
  subtraction, then an assignment
  + Assume that the result of the addition/subtraction is stored in a
    CPU register or on the stack: in either case, in a temporary
    location. Here's a depiction:
    #+begin_example
 Temp1 = N + 1  ### increment N and save the incremented value (N is unchanged so far)
 N = Temp1      ### assign the incremented value to N
    #+end_example
    + Temp1 is T1's temporary location, Temp2 is T2's temporary location
+ The machine has multiple CPUs: T1 executes on one of these as T2
  executes on another
+ The following depicts one possible outcome of a race condition:
  #+begin_example
     Clock ticks:
  
   C1: Temp1 = 5 + 1 = 6   ## T1's addition
   C2: Temp2 = 5 - 1 = 4   ## T2's subtraction (T1's assignment has not occurred yet.)
   C3: N = Temp2           ## T2's assignment operation (N is decremented to 4)
   C4: N = Temp1           ## T1's assignment operation (N is incremented to 6).
  #+end_example
+ After a single increment by 1 and a single decrement by 1, N winds up as 6--not 5.
  + Improper interleaving of the operations is at fault.
  + Whichever thread starts its arithmetic operation
    (addition/subtraction) must be allow to complete the assignment
    without interruption.
    + This is precisely what /thread synchronization/ through locking
      of N ensures: single-threaded execution of the arithmetic
      operation and the subsequent assignment.
** Overview of Explicit Thread Locking
*** code examples
#+BEGIN_SRC java
/* Thread synchronization mechanisms: code examples */

/** C example **/
static pthread_mutex_t lock;  /* declare a lock */              /** line 1 **/
void increment_n() {                                            /** line 2 **/
    pthread_mutex_lock(&lock);                                  /** line 3 **/
    n = n + 1;  /* critical section code */                     /** line 4 **/
    pthread_mutex_unlock(&lock);                                /** line 5 **/
}

/** Java example **/
class Test {
    static int n; // a single, shared storage location          /** line 6 **/
    static Object lock = new Object(); // can't be null         /** line 7 **/
    void incrementN() {
	synchronized(lock) {                                    /** line 8 **/
	    n = n + 1; /* critical section code */              /** line 9 **/
	}                                                       /** line 10 **/
    }
}
#+END_SRC
***  Mechanisms for thread coordination
# chapter 5: threadSync.txt
+ The terms below are associated with processes and threads, but the
  focus now is on threads given the assumption that a process executes
  in that one of its threads executes.
+ A /critical section/ of code must be executed in single-threaded fashion because
   otherwise a race condition could arise.
  + For example, if threads T1 and T2 can both execute 
    : N = N + 1  ## the same storage N is accessible to T1 and T2
    this statement is a critical section of code. T1 and T2 should not
    execute this section at the same time.
+ A locking mechanism should provide the following services:
  + The mechanism should ensure /mutual exclusion/: if T1 manages to
    grab the lock, then T2 is excluded from the critical section that
    the lock protects while T1 holds the lock; and vice versa.
  + The mechanism should ensure /progress/: if no thread holds the
    lock, then some thread should be able to grab it and thereby enter
    the critical section that the lock protects.
+ Various locking mechanisms:
  + A /semaphore/ restricts the number of threads allowed to access a
    shared resource (e.g., a shared function). For example, /semahore/
    might allow two threads to access a chunk of code simultaneously,
    but no more than two. A semaphore is thus a set of permission
    tickets, which enable a thread to access a resource.
    + Semaphores as /tickets/: a semaphore is like a ticket that
      grants access to a resource.  A semaphore with a value of three
      would grant access to three threads at most at a time.
  + A /mutex/ is a semaphore with a value of 1: whichever thread holds
    the mutex has access to the protected resource, whereas all others
    are excluded.
    + A mutex enforces mutual exclusion, but a semaphore with a value
      > 1 would not.
  + A /monitor/ (which the Java /synchronized/ block provides) is a
    mechanism that enforces mutual exclusion, supports progress, and
    has addition mechanisms for thread cooperation: in Java's case,
    the /wait/ mechanism supports quiet waiting for a lock to be
    released, and the /notify/ mechanism notifies waiters that a lock
    has been released.

** A Sample Deadlock in Java
*** using the shell
#+BEGIN_SRC sh
bash-3.2$ javac Deadlock.java 
bash-3.2$ java Deadlock
thread2 holds lock2
thread1 holds lock1
thread2 waiting for lock1
	(thread2 needs lock1 to release lock2...)
thread1 waiting for lock2
	(thread1 needs lock2 to release lock1...)
  ^C ^Cbash-3.2$ 
bash-3.2$ java Deadlock
thread1 holds lock1
thread2 holds lock2
thread2 waiting for lock1
thread1 waiting for lock2
	(thread2 needs lock1 to release lock2...)
	(thread1 needs lock2 to release lock1...)
  ^C ^Cbash-3.2$ 
#+END_SRC
