Vorlesung/ParProg-Multithreading.html

<div id="outline-container-orgd08b9ce" class="outline-3">
<h3 id="orgd08b9ce">Analysis of the Race Condition Code</h3>
<div class="outline-text-3" id="text-orgd08b9ce">
<p>
A detailed look at how a race condition occurs
</p>

<ul class="org-ul">
<li>T1 and T2 are threads in process P: T1 and T2 have access the same
memory locations.</li>
<li>N is memory location within the address space that T1 and T2 share</li>
<li><p>
T1 tries to increment n at the same time that T2 tries to
decrement N.
</p>
<pre class="example">
      N = N + 1  +---+  N = N - 1        ## Are these statements 'atomic'?
   T1-----------&gt;| 5 |&lt;-----------T2
	         +---+
	           N
</pre></li>
<li>Each pseudo-code instruction involves two operations: an addition or
subtraction, then an assignment
<ul class="org-ul">
<li><p>
Assume that the result of the addition/subtraction is stored in a
CPU register or on the stack: in either case, in a temporary
location. Here's a depiction:
</p>
<pre class="example">
 Temp1 = N + 1  ### increment N and save the incremented value (N is unchanged so far)
 N = Temp1      ### assign the incremented value to N
</pre>
<ul class="org-ul">
<li>Temp1 is T1's temporary location, Temp2 is T2's temporary location</li>
</ul></li>
</ul></li>
<li>The machine has multiple CPUs: T1 executes on one of these as T2
executes on another</li>
<li><p>
The following depicts one possible outcome of a race condition:
</p>
<pre class="example">
     Clock ticks:
  
   C1: Temp1 = 5 + 1 = 6   ## T1's addition
   C2: Temp2 = 5 - 1 = 4   ## T2's subtraction (T1's assignment has not occurred yet.)
   C3: N = Temp2           ## T2's assignment operation (N is decremented to 4)
   C4: N = Temp1           ## T1's assignment operation (N is incremented to 6).
</pre></li>
<li>After a single increment by 1 and a single decrement by 1, N winds up as 6&#x2013;not 5.
<ul class="org-ul">
<li>Improper interleaving of the operations is at fault.</li>
<li>Whichever thread starts its arithmetic operation
(addition/subtraction) must be allow to complete the assignment
without interruption.
<ul class="org-ul">
<li>This is precisely what <i>thread synchronization</i> through locking
of N ensures: single-threaded execution of the arithmetic
operation and the subsequent assignment.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfafa4cd" class="outline-3">
<h3 id="orgfafa4cd">Overview of Explicit Thread Locking</h3>
<div class="outline-text-3" id="text-orgfafa4cd">
</div><div id="outline-container-org58f3aa6" class="outline-4">
<h4 id="org58f3aa6">code examples</h4>
<div class="outline-text-4" id="text-org58f3aa6">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">Thread synchronization mechanisms: code examples */</span>

<span style="color: #036A07;">/** C example **/</span>
<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">pthread_mutex_t</span> <span style="color: #BA36A5;">lock</span>;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">declare a lock */</span>              <span style="color: #036A07;">/** line 1 **/</span>
<span style="color: #6434A3;">void</span> <span style="color: #006699;">increment_n</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>                                            <span style="color: #036A07;">/** line 2 **/</span>
    pthread_mutex_lock<span style="color: #7388D6;">(</span>&amp;lock<span style="color: #7388D6;">)</span>;                                  <span style="color: #036A07;">/** line 3 **/</span>
    n = n + 1;  <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">critical section code */</span>                     <span style="color: #036A07;">/** line 4 **/</span>
    pthread_mutex_unlock<span style="color: #7388D6;">(</span>&amp;lock<span style="color: #7388D6;">)</span>;                                <span style="color: #036A07;">/** line 5 **/</span>
<span style="color: #707183;">}</span>

<span style="color: #036A07;">/** Java example **/</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Test</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">a single, shared storage location          /** line 6 **/</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">lock</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Object</span><span style="color: #7388D6;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">can't be null         /** line 7 **/</span>
    <span style="color: #6434A3;">void</span> <span style="color: #006699;">incrementN</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">synchronized</span><span style="color: #909183;">(</span>lock<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                                    <span style="color: #036A07;">/** line 8 **/</span>
            n = n + 1; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">critical section code */</span>              <span style="color: #036A07;">/** line 9 **/</span>
        <span style="color: #909183;">}</span>                                                       <span style="color: #036A07;">/** line 10 **/</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org79222bc" class="outline-4">
<h4 id="org79222bc">Mechanisms for thread coordination</h4>
<div class="outline-text-4" id="text-org79222bc">
<ul class="org-ul">
<li>The terms below are associated with processes and threads, but the
focus now is on threads given the assumption that a process executes
in that one of its threads executes.</li>
<li>A <i>critical section</i> of code must be executed in single-threaded fashion because
otherwise a race condition could arise.
<ul class="org-ul">
<li><p>
For example, if threads T1 and T2 can both execute 
</p>
<pre class="example">
N = N + 1  ## the same storage N is accessible to T1 and T2

</pre>
<p>
this statement is a critical section of code. T1 and T2 should not
execute this section at the same time.
</p></li>
</ul></li>
<li>A locking mechanism should provide the following services:
<ul class="org-ul">
<li>The mechanism should ensure <i>mutual exclusion</i>: if T1 manages to
grab the lock, then T2 is excluded from the critical section that
the lock protects while T1 holds the lock; and vice versa.</li>
<li>The mechanism should ensure <i>progress</i>: if no thread holds the
lock, then some thread should be able to grab it and thereby enter
the critical section that the lock protects.</li>
</ul></li>
<li>Various locking mechanisms:
<ul class="org-ul">
<li>A <i>semaphore</i> restricts the number of threads allowed to access a
shared resource (e.g., a shared function). For example, <i>semahore</i>
might allow two threads to access a chunk of code simultaneously,
but no more than two. A semaphore is thus a set of permission
tickets, which enable a thread to access a resource.
<ul class="org-ul">
<li>Semaphores as <i>tickets</i>: a semaphore is like a ticket that
grants access to a resource.  A semaphore with a value of three
would grant access to three threads at most at a time.</li>
</ul></li>
<li>A <i>mutex</i> is a semaphore with a value of 1: whichever thread holds
the mutex has access to the protected resource, whereas all others
are excluded.
<ul class="org-ul">
<li>A mutex enforces mutual exclusion, but a semaphore with a value
&gt; 1 would not.</li>
</ul></li>
<li>A <i>monitor</i> (which the Java <i>synchronized</i> block provides) is a
mechanism that enforces mutual exclusion, supports progress, and
has addition mechanisms for thread cooperation: in Java's case,
the <i>wait</i> mechanism supports quiet waiting for a lock to be
released, and the <i>notify</i> mechanism notifies waiters that a lock
has been released.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1255b62" class="outline-3">
<h3 id="org1255b62">A Sample Deadlock in Java</h3>
<div class="outline-text-3" id="text-org1255b62">
</div><div id="outline-container-orge64cf5d" class="outline-4">
<h4 id="orge64cf5d">using the shell</h4>
<div class="outline-text-4" id="text-orge64cf5d">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ javac Deadlock.java 
bash-3.2$ java Deadlock
thread2 holds lock2
thread1 holds lock1
thread2 waiting for lock1
        <span style="color: #707183;">(</span>thread2 needs lock1 to release lock2...<span style="color: #707183;">)</span>
thread1 waiting for lock2
        <span style="color: #707183;">(</span>thread1 needs lock2 to release lock1...<span style="color: #707183;">)</span>
  ^C ^Cbash-3.2$ 
bash-3.2$ java Deadlock
thread1 holds lock1
thread2 holds lock2
thread2 waiting for lock1
thread1 waiting for lock2
        <span style="color: #707183;">(</span>thread2 needs lock1 to release lock2...<span style="color: #707183;">)</span>
        <span style="color: #707183;">(</span>thread1 needs lock2 to release lock1...<span style="color: #707183;">)</span>
  ^C ^Cbash-3.2$ </pre>
</pre>
</div>
</div>
</div>
