Vorlesung/ParProg-Multithreading.html
<div id="outline-container-orgb3db812" class="outline-4">
<h4 id="orgb3db812">source code</h4>
<div class="outline-text-4" id="text-orgb3db812">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** To compile and run from the command-line:</span>
<span style="color: #036A07;">      javac Deadlock.java</span>
<span style="color: #036A07;">      java Deadlock</span>
<span style="color: #036A07;">*/</span>
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Deadlock</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">lock1</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Object</span><span style="color: #7388D6;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">a single lock1                   /** line 1 **/</span>
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">lock2</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Object</span><span style="color: #7388D6;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">a single lock2</span>
    
    <span style="color: #036A07;">/** Each thread executes its run() method. **/</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">args</span><span style="color: #909183;">[]</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">Thread</span> <span style="color: #BA36A5;">thread1</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>  
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #709870;">()</span> <span style="color: #709870;">{</span>                            
                    <span style="color: #0000FF;">synchronized</span><span style="color: #907373;">(</span>lock1<span style="color: #907373;">)</span> <span style="color: #907373;">{</span>                                   <span style="color: #036A07;">/** line 2 **/</span>
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"thread1 holds lock1"</span><span style="color: #6276BA;">)</span>;
                        <span style="color: #0000FF;">try</span> <span style="color: #6276BA;">{</span> Thread.sleep<span style="color: #858580;">(</span>2<span style="color: #858580;">)</span>; <span style="color: #6276BA;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #6276BA;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #6276BA;">)</span> <span style="color: #6276BA;">{</span> <span style="color: #6276BA;">}</span>     <span style="color: #036A07;">/** line 3 **/</span>
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"thread1 waiting for lock2"</span><span style="color: #6276BA;">)</span>;
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"\t(thread1 needs lock2 to release lock1...)"</span><span style="color: #6276BA;">)</span>;
                        <span style="color: #0000FF;">synchronized</span><span style="color: #6276BA;">(</span>lock2<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">{</span>                               <span style="color: #036A07;">/** line 4 **/</span>
                            print<span style="color: #858580;">(</span><span style="color: #008000;">"thread1 holds lock1 and lock2"</span><span style="color: #858580;">)</span>;
                        <span style="color: #6276BA;">}</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lock2 released here                            /** line 5 **/</span>
                    <span style="color: #907373;">}</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lock1 released here                                /** line 6 **/</span>
                <span style="color: #709870;">}</span> 
            <span style="color: #909183;">}</span>;
        <span style="color: #6434A3;">Thread</span> <span style="color: #BA36A5;">thread2</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #709870;">()</span> <span style="color: #709870;">{</span>
                    <span style="color: #0000FF;">synchronized</span><span style="color: #907373;">(</span>lock2<span style="color: #907373;">)</span> <span style="color: #907373;">{</span>                                   <span style="color: #036A07;">/** line 7 **/</span>
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"thread2 holds lock2"</span><span style="color: #6276BA;">)</span>;
                        <span style="color: #0000FF;">try</span> <span style="color: #6276BA;">{</span> Thread.sleep<span style="color: #858580;">(</span>2<span style="color: #858580;">)</span>; <span style="color: #6276BA;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #6276BA;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #6276BA;">)</span> <span style="color: #6276BA;">{</span> <span style="color: #6276BA;">}</span>
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"thread2 waiting for lock1"</span><span style="color: #6276BA;">)</span>;
                        print<span style="color: #6276BA;">(</span><span style="color: #008000;">"\t(thread2 needs lock1 to release lock2...)"</span><span style="color: #6276BA;">)</span>;
                        <span style="color: #0000FF;">synchronized</span><span style="color: #6276BA;">(</span>lock1<span style="color: #6276BA;">)</span> <span style="color: #6276BA;">{</span>                               <span style="color: #036A07;">/** line 8 **/</span>
                            print<span style="color: #858580;">(</span><span style="color: #008000;">"thread2 holds lock2 and lock1"</span><span style="color: #858580;">)</span>;
                        <span style="color: #6276BA;">}</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lock1 released here                            /** line 9 **/</span>
                    <span style="color: #907373;">}</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lock2 released here                                /** line 10 **/</span>
                <span style="color: #709870;">}</span>
            <span style="color: #909183;">}</span>;
        thread1.start<span style="color: #909183;">()</span>;                                                    <span style="color: #036A07;">/** line 11 **/</span>
        thread2.start<span style="color: #909183;">()</span>;                                                    <span style="color: #036A07;">/** line 12 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">print</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">obj</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> System.out.println<span style="color: #909183;">(</span>obj<span style="color: #909183;">)</span>; <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org83e8dc1" class="outline-3">
<h3 id="org83e8dc1">High-level Concurrency Management in Multithreading</h3>
<div class="outline-text-3" id="text-org83e8dc1">
<ul class="org-ul">
<li>Belaboring the obvious: multithreading is far trickier to manage than multiprocessing
<ul class="org-ul">
<li>The OS keeps the processes in multiprocessing from stepping on one another's storge.</li>
<li>The programmer must do the same for threads within a process: thread coordination</li>
</ul></li>
<li><p>
How to support to thread-safety (i.e., safety from race conditions)?
</p>
<ul class="org-ul">
<li>Consider an in-memory mutable list and an <i>add</i> operation.</li>
</ul>
<pre class="example">
       ADD 3  +---+---+
thread-------&gt;| 1 | 2 |        ## list L before the ADD
              +---+---+
              +---+---+---+
              | 1 | 2 | 3 |    ## list L after the ADD, which changes the original list
              +---+---+---+
</pre></li>
<li>Basic Java approach: Ensure mutual exclusion on shared storage through locking.
<ul class="org-ul">
<li>Locking allows only single-threaded access to the list L during an ADD operation.</li>
</ul></li>

<li><p>
Basic Clojure approach: make in-memory objects immutable by default, with a few exceptions
</p>
<ul class="org-ul">
<li>The ADD operation first makes a copy of the original list, and then changes the copy.</li>
</ul>
<pre class="example">
       ADD 3  +---+---+
thread-------&gt;| 1 | 2 |        ## list L 
              +---+---+
                  L

              +---+---+
              | 1 | 2 |        ## copy of list L
              +---+---+
                  Lc

              +---+---+---+
              | 1 | 2 | 3 |    ## copy after the ADD (original is unchanged)
              +---+---+---+
                  Lc
</pre></li>
<li><p>
The preferred Go approach: have a single thread control access to
list L, with other threads sending messages such as ADD to this
controlling thread.
</p>
<ul class="org-ul">
<li>The messages are sent through a thread-safe channel.</li>
</ul>
<pre class="example">
             +---+---+
             | 1 | 2 |      ## a single thread T controls access to L
             +---+---+

        ADD 3                ADD 33
thread1-------&gt;channel to T&lt;--------thread2  ## the channel has built-in synchronization
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgfe4cebe" class="outline-3">
<h3 id="orgfe4cebe">Wrapup of multithreading basics and miscellany</h3>
<div class="outline-text-3" id="text-orgfe4cebe">
</div>
