Vorlesung/ParProg-Multithreading.org
**** Wrapup

+ Multithreading can be a highly efficient way to do concurrent
  programming, as thread-level context switches are very cheap.
  + It's the preferred approach to concurrency in languages such as
    Java and C#.
+ Multithreading has twin challenges for the programmer:
  + Avoid race conditions by ensuring that multiple threads don't
    access shared memory locations in inappropriate ways.
    + Ensure that critical sections are executed in single-threaded
      mode.
  + Avoid /over synchronization/ that degrades performance and may
    result in deadlock.
+ Languages now offer programmers high-level constructs and types to
  ease the challenges of multithreaded programming.
  + But sometimes a simple mutex is still the way to go.
 
**** Native versus green threads, and the Global Interpreter Lock (GIL)

+ A /native thread/ is under kernel OS control when it comes to
  scheduling.
  + Since roughly 2000, Java Thread instances map to /native/
    threads. (Same for C#.)
  + C's /pthreads/ (the 'p' for POSIX API standardization) are
    /native/ threads.
+ A /green thread/ (aka /microthread/, /tasklet/) is under a particular language's runtime control.
  + In effect, /green threads/ emulate native threads, and may provide
    better performance for operations such as thread creation and
    synchronization.
  + Prior to version 1.9, for example, Ruby's standard implementation (CRuby) had only green threads.
+ A GIL is a mechanism (in implementation, a mutex) that a runtime
  uses to allow only one thread to execute at a time, even in a
  multithreaded environment: no thread-level parallelism.
  + The standard implementations of Ruby (CRuby) and Python (CPython) have a GIL.

** Exercise for basic multithreading
# chapter 5: exerciseMT.txt

+ Fix the RaceC program (RaceC.java) by providing explicit locking.
  + Use synchronized blocks and a shared lock to ensure that threads
    t1 and t2 do the increment and decrement operations /atomically/
    (that is, without interruption).
  + *Hint:* use a static field as the lock to ensure there's a single instance of the lock.
+ To get a sense of what thread syncrhonization costs, time the RaceC
  program with and without thread synchronization.
  + The program's execution can be timed in various ways, including the way sketched below:
  #+BEGIN_SRC java
final long startTime = System.currentTimeMillis();
/*** code to be timed ***/
final long stopTime = System.currentTimeMillis();
final long latency = stopTime - startTime;
  #+END_SRC

* Multithreading -- Vertiefung
#  Multithreading Through Richer Code Examples 
# ev. überspringen / Studi-Thema
# Chapter 6
 Three questions:
1. What is the basic behavior of *uncoordinated* threads?
2. What are the possible ways for coordinating threads?
   multiple answers from low level to high level
3. How can threads cooperate to boost performance?
** The Miser-Spendthrift Problem In C
# Geizhals-Verschwender-Problem
# chapter 6
+ Look at the system (close to the metal)
+ miser increments an account by one
+ spendthrift decrements the same account by one
+ number of times to increment/decrement given by an command line argument
