Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org0c6744b" class="outline-5">
<h5 id="org0c6744b">Wrapup</h5>
<div class="outline-text-5" id="text-org0c6744b">
<ul class="org-ul">
<li>Multithreading can be a highly efficient way to do concurrent
programming, as thread-level context switches are very cheap.
<ul class="org-ul">
<li>It's the preferred approach to concurrency in languages such as
Java and C#.</li>
</ul></li>
<li>Multithreading has twin challenges for the programmer:
<ul class="org-ul">
<li>Avoid race conditions by ensuring that multiple threads don't
access shared memory locations in inappropriate ways.
<ul class="org-ul">
<li>Ensure that critical sections are executed in single-threaded
mode.</li>
</ul></li>
<li>Avoid <i>over synchronization</i> that degrades performance and may
result in deadlock.</li>
</ul></li>
<li>Languages now offer programmers high-level constructs and types to
ease the challenges of multithreaded programming.
<ul class="org-ul">
<li>But sometimes a simple mutex is still the way to go.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb6c1480" class="outline-5">
<h5 id="orgb6c1480">Native versus green threads, and the Global Interpreter Lock (GIL)</h5>
<div class="outline-text-5" id="text-orgb6c1480">
<ul class="org-ul">
<li>A <i>native thread</i> is under kernel OS control when it comes to
scheduling.
<ul class="org-ul">
<li>Since roughly 2000, Java Thread instances map to <i>native</i>
threads. (Same for C#.)</li>
<li>C's <i>pthreads</i> (the 'p' for POSIX API standardization) are
<i>native</i> threads.</li>
</ul></li>
<li>A <i>green thread</i> (aka <i>microthread</i>, <i>tasklet</i>) is under a particular language's runtime control.
<ul class="org-ul">
<li>In effect, <i>green threads</i> emulate native threads, and may provide
better performance for operations such as thread creation and
synchronization.</li>
<li>Prior to version 1.9, for example, Ruby's standard implementation (CRuby) had only green threads.</li>
</ul></li>
<li>A GIL is a mechanism (in implementation, a mutex) that a runtime
uses to allow only one thread to execute at a time, even in a
multithreaded environment: no thread-level parallelism.
<ul class="org-ul">
<li>The standard implementations of Ruby (CRuby) and Python (CPython) have a GIL.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org24ae388" class="outline-3">
<h3 id="org24ae388">Exercise for basic multithreading</h3>
<div class="outline-text-3" id="text-org24ae388">
<ul class="org-ul">
<li>Fix the RaceC program (RaceC.java) by providing explicit locking.
<ul class="org-ul">
<li>Use synchronized blocks and a shared lock to ensure that threads
t1 and t2 do the increment and decrement operations <i>atomically</i>
(that is, without interruption).</li>
<li><b>Hint:</b> use a static field as the lock to ensure there's a single instance of the lock.</li>
</ul></li>
<li><p>
To get a sense of what thread syncrhonization costs, time the RaceC
program with and without thread synchronization.
</p>
<ul class="org-ul">
<li>The program's execution can be timed in various ways, including the way sketched below:</li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">startTime</span> = System.currentTimeMillis<span style="color: #707183;">()</span>;
<span style="color: #036A07;">/*** code to be timed ***/</span>
<span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">stopTime</span> = System.currentTimeMillis<span style="color: #707183;">()</span>;
<span style="color: #0000FF;">final</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">latency</span> = stopTime - startTime;</pre>
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgacb5b68" class="outline-2">
<h2 id="orgacb5b68">Multithreading &#x2013; Vertiefung</h2>
<div class="outline-text-2" id="text-orgacb5b68">
<p>
Three questions:
</p>
<ol class="org-ol">
<li>What is the basic behavior of <b>uncoordinated</b> threads?</li>
<li>What are the possible ways for coordinating threads?
multiple answers from low level to high leven</li>
<li>How can threads cooperate to boost performance?</li>
</ol>
</div>
<div id="outline-container-org56aea82" class="outline-3">
<h3 id="org56aea82">The Miser-Spendthrift Problem In C</h3>
<div class="outline-text-3" id="text-org56aea82">
<ul class="org-ul">
<li>Look at the system (close to the metal)</li>
<li>miser increments an account by one</li>
<li>spendthrift decrements the same account by one</li>
<li>number of times to increment/decrement given by an command line argument</li>
</ul>
</div>
