Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org1f17010" class="outline-4">
<h4 id="org1f17010">Fixing The Miser-Spendthrift Problem In C</h4>
<div class="outline-text-4" id="text-org1f17010">
</div><div id="outline-container-orgd71fe79" class="outline-5">
<h5 id="orgd71fe79">source code</h5>
<div class="outline-text-5" id="text-orgd71fe79">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">To compile: gcc -o miserSpendthriftFix miserSpendthriftFix.c -lpthread *</span><span style="color: #8D8D84;">*/</span>

<span style="color: #808080;">#include</span><span style="color: #707183;">&lt;</span><span style="color: #008000;">stdio.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span><span style="color: #707183;">&lt;</span><span style="color: #008000;">string.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span><span style="color: #707183;">&lt;</span><span style="color: #008000;">pthread.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span><span style="color: #707183;">&lt;</span><span style="color: #008000;">stdlib.h</span><span style="color: #707183;">&gt;</span>
<span style="color: #808080;">#include</span><span style="color: #707183;">&lt;</span><span style="color: #008000;">unistd.h</span><span style="color: #707183;">&gt;</span>

<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">balance</span> = 0; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">shared storage across the threads *</span><span style="color: #8D8D84;">*/</span>              <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 1 *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">pthread_mutex_t</span> <span style="color: #BA36A5;">lock</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">named lock for clarity; any name would do </span><span style="color: #8D8D84;">*/</span>   <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 2 *</span><span style="color: #8D8D84;">*/</span>

<span style="color: #6434A3;">void</span> <span style="color: #006699;">report_and_die</span><span style="color: #707183;">(</span><span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">msg</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
   perror<span style="color: #7388D6;">(</span>msg<span style="color: #7388D6;">)</span>;
   exit<span style="color: #7388D6;">(</span>0<span style="color: #7388D6;">)</span>;
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">void</span>* <span style="color: #006699;">deposit</span><span style="color: #707183;">(</span><span style="color: #6434A3;">void</span>* <span style="color: #BA36A5;">n</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">miser code *</span><span style="color: #8D8D84;">*/</span>                                          
   <span style="color: #6434A3;">int</span>* <span style="color: #BA36A5;">ptr</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span>*<span style="color: #7388D6;">)</span> n;
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">limit</span> = *ptr, <span style="color: #BA36A5;">i</span>;
   <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; limit; i++<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
     <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>pthread_mutex_lock<span style="color: #709870;">(</span>&amp;lock<span style="color: #709870;">)</span> == 0<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                                     <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 3 *</span><span style="color: #8D8D84;">*/</span>
       balance++; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">add 1 to balance </span><span style="color: #8D8D84;">*/</span>                                       <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 4 *</span><span style="color: #8D8D84;">*/</span>
       pthread_mutex_unlock<span style="color: #709870;">(</span>&amp;lock<span style="color: #709870;">)</span>;                                            <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 5 *</span><span style="color: #8D8D84;">*/</span>
     <span style="color: #909183;">}</span>
     <span style="color: #0000FF;">else</span>
       report_and_die<span style="color: #909183;">(</span><span style="color: #008000;">"pthread_mutex_lock (deposit)"</span><span style="color: #909183;">)</span>;
   <span style="color: #7388D6;">}</span>
   <span style="color: #0000FF;">return</span> 0; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">nothing to return: NULL *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">void</span>* <span style="color: #006699;">withdraw</span><span style="color: #707183;">(</span><span style="color: #6434A3;">void</span>* <span style="color: #BA36A5;">n</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span> <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">spendthrift code *</span><span style="color: #8D8D84;">*/</span>
   <span style="color: #6434A3;">int</span>* <span style="color: #BA36A5;">ptr</span> = <span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span>*<span style="color: #7388D6;">)</span> n;
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">limit</span> = *ptr, <span style="color: #BA36A5;">i</span>;
   <span style="color: #0000FF;">for</span> <span style="color: #7388D6;">(</span>i = 0; i &lt; limit; i++<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
     <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>pthread_mutex_lock<span style="color: #709870;">(</span>&amp;lock<span style="color: #709870;">)</span> == 0<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
       balance--; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">subtract 1 from balance </span><span style="color: #8D8D84;">*/</span>
       pthread_mutex_unlock<span style="color: #709870;">(</span>&amp;lock<span style="color: #709870;">)</span>;
     <span style="color: #909183;">}</span>
     <span style="color: #0000FF;">else</span>
       report_and_die<span style="color: #909183;">(</span><span style="color: #008000;">"pthread_mute_lock (withdraw)"</span><span style="color: #909183;">)</span>;
   <span style="color: #7388D6;">}</span>
   <span style="color: #0000FF;">return</span> 0; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">nothing to return: NULL *</span><span style="color: #8D8D84;">*/</span>
<span style="color: #707183;">}</span>

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span><span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">argv</span><span style="color: #7388D6;">[]</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
   <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>argc &lt; 2<span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
      fprintf<span style="color: #909183;">(</span>stderr, <span style="color: #008000;">"Usage: miserSpendthriftFix &lt;number of operations apiece&gt;\n"</span><span style="color: #909183;">)</span>;
      <span style="color: #0000FF;">return</span> 0;
   <span style="color: #7388D6;">}</span>
   <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span> = atoi<span style="color: #7388D6;">(</span>argv<span style="color: #909183;">[</span>1<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">command-line argument conversion to integer *</span><span style="color: #8D8D84;">*/</span>
   
   <span style="color: #6434A3;">pthread_t</span> <span style="color: #BA36A5;">miser</span>, <span style="color: #BA36A5;">spendthrift</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">miser increments, spendthrift decrements </span><span style="color: #8D8D84;">*/</span> <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 6 *</span><span style="color: #8D8D84;">*/</span>
   pthread_mutex_init<span style="color: #7388D6;">(</span>&amp;lock, 0<span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">initialize the lock *</span><span style="color: #8D8D84;">*/</span> <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">!!!!!!! *</span><span style="color: #8D8D84;">*/</span>
   
   <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>pthread_create<span style="color: #909183;">(</span>&amp;miser,  0, deposit,  &amp;n<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388D6;">)</span>      <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">miser: deposit </span><span style="color: #8D8D84;">*/</span>  <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 7 *</span><span style="color: #8D8D84;">*/</span>
      report_and_die<span style="color: #7388D6;">(</span><span style="color: #008000;">"pthread_create: miser"</span><span style="color: #7388D6;">)</span>;
   <span style="color: #0000FF;">if</span> <span style="color: #7388D6;">(</span>pthread_create<span style="color: #909183;">(</span>&amp;spendthrift, 0, withdraw, &amp;n<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388D6;">)</span> <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">spendthrift: withdraw </span><span style="color: #8D8D84;">*/</span> 
      report_and_die<span style="color: #7388D6;">(</span><span style="color: #008000;">"pthread_create: spendthrift"</span><span style="color: #7388D6;">)</span>;

   <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">Force main thread to wait for the other two to die. </span><span style="color: #8D8D84;">*/</span>
   pthread_join<span style="color: #7388D6;">(</span>miser,  0<span style="color: #7388D6;">)</span>;                                                     <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 8 *</span><span style="color: #8D8D84;">*/</span>
   pthread_join<span style="color: #7388D6;">(</span>spendthrift, 0<span style="color: #7388D6;">)</span>;                                                <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 9 *</span><span style="color: #8D8D84;">*/</span>
   pthread_mutex_destroy<span style="color: #7388D6;">(</span>&amp;lock<span style="color: #7388D6;">)</span>; <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">destroy the lock, no longer needed </span><span style="color: #8D8D84;">*/</span>       <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 10 *</span><span style="color: #8D8D84;">*/</span>

   <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">Print final balance. </span><span style="color: #8D8D84;">*/</span>
   printf<span style="color: #7388D6;">(</span><span style="color: #008000;">"The final balance is: %i\n"</span>, balance<span style="color: #7388D6;">)</span>;                               <span style="color: #8D8D84;">/** </span><span style="color: #8D8D84; font-style: italic;">line 11 *</span><span style="color: #8D8D84;">*/</span>
   <span style="color: #0000FF;">return</span> 0;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
