Vorlesung/ParProg-Multithreading.org
**** using the shell
#+BEGIN_SRC shell
bash-3.2$ gcc -o miserSpendthriftFix miserSpendthriftFix.c -lpthread
bash-3.2$ ./miserSpendthrift 500000
The final balance is:           382629
bash-3.2$ ./miserSpendthrift 500000
The final balance is:           223321
bash-3.2$ ./miserSpendthriftFix 500000
The final balance is: 0
bash-3.2$ ./miserSpendthriftFix 500000
The final balance is: 0
bash-3.2$ 
#+END_SRC
** The Miser-Spendthrift Problem In Java
*** Overview
#+BEGIN_EXAMPLE
                           code
                            |
       +--------------------+--------------------+
       |                    |                    |
     acct                 acct2                acct3           ## Java package names
Account.java         Account.java         Account.java         ## Different implementations (see below)
RaceCondition.java   RaceCondition.java   RaceCondition.java   ## application, encapsulates main(...)

  acct implementation:  deliberate race condition, no thread coordination
  acct2 implementation: explicit, low-level thread coordination with synchronized blocks
  acct3 implementation: AtomicInteger, which bakes in the thread synchronization
#+END_EXAMPLE
+ All of the source code is included in the ZIP file
  miserSpendthriftJava.zip. \\
  Here are the contexts:
  #+BEGIN_EXAMPLE
      code/
      code/acct/
      code/acct/Account.java
      code/acct/RaceCondition.java
      code/acct2/
      code/acct2/Account.java
      code/acct2/RaceCondition.java
      code/acct3/
      code/acct3/Account.java
      code/acct3/RaceCondition.java
  #+END_EXAMPLE    
+ To compile and run from the /code/ directory at the command-line prompt:
  #+BEGIN_SRC shell
     javac acct/*.java
     java acct.RaceCondition 50000000

     javac acct2/*.java
     java acct2.RaceCondition 600000

     javac acct3/*.java
     java acct3.RaceCondition 7700000
  #+END_SRC

*** Demo
#+BEGIN_SRC shell
bash-3.2$ cd code
bash-3.2$ javac acct/*.java
bash-3.2$  java acct.RaceCondition 500000
Final balance: -48910
bash-3.2$  java acct.RaceCondition 500000
Final balance: 237043
bash-3.2$  java acct.RaceCondition 500000
Final balance: -30470
bash-3.2$  java acct.RaceCondition 500000
Final balance: -26171
bash-3.2$ javac acct2/*.java
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ javac acct3/*.java
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0
#+END_SRC
*** Source Code
