Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org4759580" class="outline-5">
<h5 id="org4759580">using the shell</h5>
<div class="outline-text-5" id="text-org4759580">
<div class="org-src-container">
<pre class="src src-shell">bash-3.2$ gcc -o miserSpendthriftFix miserSpendthriftFix.c -lpthread
bash-3.2$ ./miserSpendthrift 500000
The final balance is:           382629
bash-3.2$ ./miserSpendthrift 500000
The final balance is:           223321
bash-3.2$ ./miserSpendthriftFix 500000
The final balance is: 0
bash-3.2$ ./miserSpendthriftFix 500000
The final balance is: 0
bash-3.2$ </pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb8a1b6e" class="outline-3">
<h3 id="orgb8a1b6e">The Miser-Spendthrift Problem In Java</h3>
<div class="outline-text-3" id="text-orgb8a1b6e">
</div><div id="outline-container-org7c489b6" class="outline-4">
<h4 id="org7c489b6">Overview</h4>
<div class="outline-text-4" id="text-org7c489b6">
<pre class="example">
                           code
                            |
       +--------------------+--------------------+
       |                    |                    |
     acct                 acct2                acct3           ## Java package names
Account.java         Account.java         Account.java         ## Different implementations (see below)
RaceCondition.java   RaceCondition.java   RaceCondition.java   ## application, encapsulates main(...)

  acct implementation:  deliberate race condition, no thread coordination
  acct2 implementation: explicit, low-level thread coordination with synchronized blocks
  acct3 implementation: AtomicInteger, which bakes in the thread synchronization
</pre>
<ul class="org-ul">
<li><p>
All of the source code is included in the ZIP file
miserSpendthriftJava.zip. <br />
Here are the contexts:
</p>
<pre class="example">
      code/
      code/acct/
      code/acct/Account.java
      code/acct/RaceCondition.java
      code/acct2/
      code/acct2/Account.java
      code/acct2/RaceCondition.java
      code/acct3/
      code/acct3/Account.java
      code/acct3/RaceCondition.java
</pre></li>
<li><p>
To compile and run from the <i>code</i> directory at the command-line prompt:
</p>
<div class="org-src-container">
<pre class="src src-shell">     javac acct/*.java
     java acct.RaceCondition 50000000

     javac acct2/*.java
     java acct2.RaceCondition 600000

     javac acct3/*.java
     java acct3.RaceCondition 7700000</pre>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgdd84710" class="outline-4">
<h4 id="orgdd84710">Demo</h4>
<div class="outline-text-4" id="text-orgdd84710">
<div class="org-src-container">
<pre class="src src-shell">bash-3.2$ cd code
bash-3.2$ javac acct/*.java
bash-3.2$  java acct.RaceCondition 500000
Final balance: -48910
bash-3.2$  java acct.RaceCondition 500000
Final balance: 237043
bash-3.2$  java acct.RaceCondition 500000
Final balance: -30470
bash-3.2$  java acct.RaceCondition 500000
Final balance: -26171
bash-3.2$ javac acct2/*.java
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct2.RaceCondition 500000
Final balance: 0
bash-3.2$ javac acct3/*.java
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0
bash-3.2$ java acct3.RaceCondition 500000
Final balance: 0</pre>
</pre>
</div>
</div>
</div>
