Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org734d10b" class="outline-4">
<h4 id="org734d10b">Source Code</h4>
<div class="outline-text-4" id="text-org734d10b">
</div><div id="outline-container-orgb79425d" class="outline-5">
<h5 id="orgb79425d">Version Without Synchronization</h5>
<div class="outline-text-5" id="text-orgb79425d">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">package</span> <span style="color: #D0372D;">acct</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Account</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">balance</span> = 0;                                             <span style="color: #036A07;">/** line 1 **/</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Miser</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span>       <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">deposit                                  /** line 2 **/</span>
    <span style="color: #006699;">Miser</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span> 
            Account.balance++;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">how many times to increment</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Spendthrift</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">withdraw                                 /** line 3 **/</span>
    <span style="color: #006699;">Spendthrift</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span> 
            Account.balance--;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">how many times to decrement</span>
<span style="color: #707183;">}</span>

<span style="color: #036A07;">/************************************************************************/</span>

<span style="color: #0000FF;">package</span> <span style="color: #D0372D;">acct</span>;
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">RaceCondition</span> <span style="color: #707183;">{</span>                                                   <span style="color: #036A07;">/** line 4 **/</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>args.length &lt; 1<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            System.err.println<span style="color: #709870;">(</span><span style="color: #008000;">"RunCondition &lt;times to iterate&gt;"</span><span style="color: #709870;">)</span>;
            <span style="color: #0000FF;">return</span>;
        <span style="color: #909183;">}</span>
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span> = Integer.parseInt<span style="color: #909183;">(</span>args<span style="color: #709870;">[</span>0<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        <span style="color: #6434A3;">Miser</span> <span style="color: #BA36A5;">miser</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Miser</span><span style="color: #909183;">(</span>n<span style="color: #909183;">)</span>;                                            <span style="color: #036A07;">/** line 5 **/</span>
        <span style="color: #6434A3;">Spendthrift</span> <span style="color: #BA36A5;">spendthrift</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Spendthrift</span><span style="color: #909183;">(</span>n<span style="color: #909183;">)</span>;                          <span style="color: #036A07;">/** line 6 **/</span>
        miser.start<span style="color: #909183;">()</span>;       <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">start Miser                                    /** line 7 **/</span>
        spendthrift.start<span style="color: #909183;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">start Spendthrift */                           /** line 8 **/</span>
        <span style="color: #0000FF;">try</span> <span style="color: #909183;">{</span>                                                          
            miser.join<span style="color: #709870;">()</span>;       <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">wait for Miser to terminate                 /** line 9 **/</span>
            spendthrift.join<span style="color: #709870;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">wait for Spendthrift to terminate           /** 1ine 10 **/</span>
        <span style="color: #909183;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #909183;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span> System.err.println<span style="color: #709870;">(</span>e<span style="color: #709870;">)</span>; <span style="color: #909183;">}</span>
        System.out.println<span style="color: #909183;">(</span><span style="color: #008000;">"Final balance: "</span> + Account.balance<span style="color: #909183;">)</span>;     
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
