Vorlesung/ParProg-Multithreading.org
**** Version With =synchronized blocks=
#+BEGIN_SRC java
/*** Fixing the miser/spendthrift problem with explicit thread synchronization. ***/

package acct2;

public class Account {
    public static int balance = 0;                            /** line 1 **/
    public static final Object lock = new Object();           /** line 2 **/
}

class Miser extends Thread {       // deposit                 /** line 3 **/
    Miser(int howMany) { this.howMany = howMany; }

    @Override
    public void run() {
	for (int i = 0; i < howMany; i++) 
	    synchronized(Account.lock) {                      /** line 4 **/        
		Account.balance++;                            /** line 5 **/
	    }
    }
    private int howMany;    
}

class Spendthrift extends Thread { // withdraw                /** line 6 **/
    Spendthrift(int howMany) { this.howMany = howMany; }

    @Override
    public void run() {
	for (int i = 0; i < howMany; i++) 
	    synchronized(Account.lock) {                      /** line 7 **/
		Account.balance--;                            /** line 8 **/
	    }
    }
    private int howMany;
}
#+END_SRC
**** Version With =AtomicInteger=
#+BEGIN_SRC java
/*** Fixing the miser/spendthrift problem with a thread-safe data type **/

package acct3;
import java.util.concurrent.atomic.AtomicInteger;                     /** line 1 **/

public class Account {
    public static AtomicInteger balance = new AtomicInteger();        /** line 2 **/
}

class Miser extends Thread {       // deposit
    Miser(int howMany) { this.howMany = howMany; }
    @Override
    public void run() {
	for (int i = 0; i < howMany; i++)                  
	    Account.balance.incrementAndGet();                        /** line 3 **/
    }
    private int howMany;
}

class Spendthrift extends Thread { // withdraw
    Spendthrift(int howMany) { this.howMany = howMany; }
    @Override
    public void run() {
	for (int i = 0; i < howMany; i++) 
	    Account.balance.decrementAndGet();                        /** line 4 **/
    }
    private int howMany;
}
#+END_SRC
** Thread Synchronization As Cooperation
 Cooperation -- the flip side of locking in thread synchronization

+ Java/s synchronized block implements a /monitor/, a programming mechanism that supports
   mutual exclusion for thread coordination, but also supports thread cooperation.
  + In Java, some of the cooperative mechanisms (e.g., one thread explicitly yielding others)
    have been deprecated.
+ Depiction of a queue with multiple /producers/ and /consumers/:
  #+BEGIN_EXAMPLE
                    back                   front
                      \                     /
            insert   +---+---+---+---+---+---+  remove
   producer--------->| 6 | 8 | 4 | 9 | 3 | 7 |---------->consumer
   ...		     +---+---+---+---+---+---+           ...  ## any number of producers/consumers
		       A queue of six items

  #+END_EXAMPLE
  + Consider the classic example of two threads that manipulate a
    shared data structure: \\
    one thread (/producer/) inserts items into the shared structure
    (for example, a queue), whereas another thread (/consumer/)
    removes items from this structure.
    + If the queue is empty, a consumer should wait until a producer inserts an item.
      + A producer thread awakens waiting consuming threads after the insertion of an item.
    + If the queue is full, a producer should wait until a consumer
      removes an item, thereby freeing up room.
      + A consumer thread awakens waiting producing threads after the removal of an item.
+ For simplicity, a stack instead of a queue:
  #+BEGIN_EXAMPLE
      +---+
      | 7 |<-------top    ## insertions and removals occur here
      +---+
      | 3 |
      +---+
      | 9 |
      +---+
       ...

  #+END_EXAMPLE
