Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org6c35632" class="outline-5">
<h5 id="org6c35632">Version With <code>synchronized blocks</code></h5>
<div class="outline-text-5" id="text-org6c35632">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/*** Fixing the miser/spendthrift problem with explicit thread synchronization. ***/</span>

<span style="color: #0000FF;">package</span> <span style="color: #D0372D;">acct2</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Account</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">balance</span> = 0;                            <span style="color: #036A07;">/** line 1 **/</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">lock</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Object</span><span style="color: #7388D6;">()</span>;           <span style="color: #036A07;">/** line 2 **/</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Miser</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span>       <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">deposit                 /** line 3 **/</span>
    <span style="color: #006699;">Miser</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span> 
            <span style="color: #0000FF;">synchronized</span><span style="color: #909183;">(</span>Account.lock<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                      <span style="color: #036A07;">/** line 4 **/</span>        
                Account.balance++;                            <span style="color: #036A07;">/** line 5 **/</span>
            <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>;    
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Spendthrift</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">withdraw                /** line 6 **/</span>
    <span style="color: #006699;">Spendthrift</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span> 
            <span style="color: #0000FF;">synchronized</span><span style="color: #909183;">(</span>Account.lock<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                      <span style="color: #036A07;">/** line 7 **/</span>
                Account.balance--;                            <span style="color: #036A07;">/** line 8 **/</span>
            <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge5b381c" class="outline-5">
<h5 id="orge5b381c">Version With <code>AtomicInteger</code></h5>
<div class="outline-text-5" id="text-orge5b381c">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/*** Fixing the miser/spendthrift problem with a thread-safe data type **/</span>

<span style="color: #0000FF;">package</span> <span style="color: #D0372D;">acct3</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #D0372D;">atomic</span>.<span style="color: #6434A3;">AtomicInteger</span>;                     <span style="color: #036A07;">/** line 1 **/</span>

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Account</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">AtomicInteger</span> <span style="color: #BA36A5;">balance</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">AtomicInteger</span><span style="color: #7388D6;">()</span>;        <span style="color: #036A07;">/** line 2 **/</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Miser</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span>       <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">deposit</span>
    <span style="color: #006699;">Miser</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span>                  
            Account.balance.incrementAndGet<span style="color: #909183;">()</span>;                        <span style="color: #036A07;">/** line 3 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>;
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Spendthrift</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">withdraw</span>
    <span style="color: #006699;">Spendthrift</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.howMany = howMany; <span style="color: #7388D6;">}</span>
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">howMany</span>; i++<span style="color: #909183;">)</span> 
            Account.balance.decrementAndGet<span style="color: #909183;">()</span>;                        <span style="color: #036A07;">/** line 4 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">howMany</span>;
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org39e48a2" class="outline-3">
<h3 id="org39e48a2">Thread Synchronization As Cooperation</h3>
<div class="outline-text-3" id="text-org39e48a2">
<p>
Cooperation &#x2013; the flip side of locking in thread synchronization
</p>

<ul class="org-ul">
<li>Java/s synchronized block implements a <i>monitor</i>, a programming mechanism that supports
mutual exclusion for thread coordination, but also supports thread cooperation.
<ul class="org-ul">
<li>In Java, some of the cooperative mechanisms (e.g., one thread explicitly yielding others)
have been deprecated.</li>
</ul></li>
<li><p>
Depiction of a queue with multiple <i>producers</i> and <i>consumers</i>:
</p>
<pre class="example">
                    back                   front
                      \                     /
            insert   +---+---+---+---+---+---+  remove
   producer---------&gt;| 6 | 8 | 4 | 9 | 3 | 7 |----------&gt;consumer
   ...		     +---+---+---+---+---+---+           ...  ## any number of producers/consumers
		       A queue of six items

</pre>
<ul class="org-ul">
<li>Consider the classic example of two threads that manipulate a
shared data structure: <br />
one thread (<i>producer</i>) inserts items into the shared structure
(for example, a queue), whereas another thread (<i>consumer</i>)
removes items from this structure.
<ul class="org-ul">
<li>If the queue is empty, a consumer should wait until a producer inserts an item.
<ul class="org-ul">
<li>A producer thread awakens waiting consuming threads after the insertion of an item.</li>
</ul></li>
<li>If the queue is full, a producer should wait until a consumer
removes an item, thereby freeing up room.
<ul class="org-ul">
<li>A consumer thread awakens waiting producing threads after the removal of an item.</li>
</ul></li>
</ul></li>
</ul></li>
<li><p>
For simplicity, a stack instead of a queue:
</p>
<pre class="example">
      +---+
      | 7 |&lt;-------top    ## insertions and removals occur here
      +---+
      | 3 |
      +---+
      | 9 |
      +---+
       ...

</pre></li>
</ul>
</div>
