Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org8592778" class="outline-4">
<h4 id="org8592778">The Thread-Safe Stack Example In Java (Source Code)</h4>
<div class="outline-text-4" id="text-org8592778">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** javac StackTS.java</span>
<span style="color: #036A07;">    java MainTS</span>

<span style="color: #036A07;">    Kill at the command-line with Control-C.</span>
<span style="color: #036A07;">*/</span>

<span style="color: #036A07;">/** A thread-safe producer/consumer application with thread</span>
<span style="color: #036A07;">    coordination and cooperation.</span>
<span style="color: #036A07;">*/</span>

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Random</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">StackTS</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">static</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">capacity</span> = 8;                      
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">top</span> = -1; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">empty stack when top == -1</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> <span style="color: #BA36A5;">stack</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">int</span><span style="color: #7388D6;">[</span>capacity<span style="color: #7388D6;">]</span>;

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">When an entire method is synchronized, the implicit lock is the current object</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">--'this' in Java.</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Hence, methods push and pop are effectively locked together: only one may be</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">accessed at a time.</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">push</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">Integer</span> <span style="color: #BA36A5;">n</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>             <span style="color: #036A07;">/** line 1 **/</span>
        <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>top + 1<span style="color: #709870;">)</span> == capacity<span style="color: #909183;">)</span> <span style="color: #909183;">{</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">full?           /** line 2 **/</span>
            <span style="color: #0000FF;">try</span> <span style="color: #709870;">{</span>
                wait<span style="color: #907373;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">if so, wait for a pop           /** line 3 **/</span>
            <span style="color: #709870;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #709870;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span> <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
        log<span style="color: #909183;">(</span>n + <span style="color: #008000;">" pushed at "</span> + <span style="color: #709870;">(</span>top + 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span>;                <span style="color: #036A07;">/** line 4 **/</span>
        stack<span style="color: #909183;">[</span>++top<span style="color: #909183;">]</span> = n;                                  <span style="color: #036A07;">/** line 5 **/</span>
        notifyAll<span style="color: #909183;">()</span>;                                       <span style="color: #036A07;">/** line 6 **/</span>
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">pop</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                       <span style="color: #036A07;">/** line 7 **/</span>
        <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span>top &lt; 0<span style="color: #909183;">)</span> <span style="color: #909183;">{</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">empty?                        /** line 8 **/</span>
            <span style="color: #0000FF;">try</span> <span style="color: #709870;">{</span>
                wait<span style="color: #907373;">()</span>;                                    <span style="color: #036A07;">/** line 9 **/</span>
            <span style="color: #709870;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #709870;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span> <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
        log<span style="color: #909183;">(</span>stack<span style="color: #709870;">[</span>top<span style="color: #709870;">]</span> + <span style="color: #008000;">" popped at "</span> + top<span style="color: #909183;">)</span>;             <span style="color: #036A07;">/** line 10 **/</span>
        top--;                                             <span style="color: #036A07;">/** line 11 **/</span>
        notifyAll<span style="color: #909183;">()</span>;                                       <span style="color: #036A07;">/** line 12 **/</span>
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">log</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">msg</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        System.out.println<span style="color: #909183;">(</span>msg<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Pusher</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Random</span> <span style="color: #BA36A5;">rand</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Random</span><span style="color: #7388D6;">()</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">StackTS</span> <span style="color: #BA36A5;">stack</span>;

    <span style="color: #006699;">Pusher</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">StackTS</span> <span style="color: #BA36A5;">stack</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.stack = stack; <span style="color: #7388D6;">}</span>           <span style="color: #036A07;">/** line 12 **/</span>
    
    <span style="color: #D0372D;">@Override</span> 
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span><span style="color: #D0372D;">true</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                                      <span style="color: #036A07;">/** line 13 **/</span>
            stack.push<span style="color: #709870;">(</span>rand.nextInt<span style="color: #907373;">(</span>100<span style="color: #907373;">)</span><span style="color: #709870;">)</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">0 through 99</span>
            <span style="color: #0000FF;">try</span> <span style="color: #709870;">{</span>
                Thread.sleep<span style="color: #907373;">(</span>rand.nextInt<span style="color: #6276BA;">(</span>200<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">sleep 0 to 199 milliseconds</span>
            <span style="color: #709870;">}</span>  <span style="color: #0000FF;">catch</span><span style="color: #709870;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span> <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Popper</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">Thread</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Random</span> <span style="color: #BA36A5;">rand</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Random</span><span style="color: #7388D6;">()</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">StackTS</span> <span style="color: #BA36A5;">stack</span>;
    
    <span style="color: #006699;">Popper</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">StackTS</span> <span style="color: #BA36A5;">stack</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.stack = stack; <span style="color: #7388D6;">}</span>            <span style="color: #036A07;">/** line 14 **/</span>
    
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span><span style="color: #D0372D;">true</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            stack.pop<span style="color: #709870;">()</span>;                                     <span style="color: #036A07;">/** line 15 **/</span>
            <span style="color: #0000FF;">try</span> <span style="color: #709870;">{</span>
                Thread.sleep<span style="color: #907373;">(</span>rand.nextInt<span style="color: #6276BA;">(</span>100<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>;
            <span style="color: #709870;">}</span> <span style="color: #0000FF;">catch</span><span style="color: #709870;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span> <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">MainTS</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">StackTS</span> <span style="color: #BA36A5;">stack</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">StackTS</span><span style="color: #909183;">()</span>;                       <span style="color: #036A07;">/** line 16 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Popper</span><span style="color: #909183;">(</span>stack<span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                           <span style="color: #036A07;">/** line 17 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Pusher</span><span style="color: #909183;">(</span>stack<span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                           <span style="color: #036A07;">/** line 18 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Pusher</span><span style="color: #909183;">(</span>stack<span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                           <span style="color: #036A07;">/** line 19 **/</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
