Vorlesung/ParProg-Multithreading.org
*** Using the Shell
#+BEGIN_SRC shell
bash-3.2$ java MainTS
82 pushed at 0
82 popped at 0
68 pushed at 0
15 pushed at 1
15 popped at 1
31 pushed at 1
31 popped at 1
68 popped at 0
46 pushed at 0
31 pushed at 1
31 popped at 1
61 pushed at 1
75 pushed at 2
75 popped at 2
82 pushed at 2
82 popped at 2
80 pushed at 2
72 pushed at 3
72 popped at 3
24 pushed at 3
12 pushed at 4
12 popped at 4
24 popped at 3
94 pushed at 3
1 pushed at 4
1 popped at 4
...
  ^C ^Cbash-3.2$ 
#+END_SRC
** The Multithreading Web Server
... in C
+ vgl. Datei =threading_server.c=
+ wird hier vorerst nicht behandelt
# Anmerkung: Client-Code als pure function in C realisiert
** Wrapup of thread synchronization as coordination and coooperation

+ Thread coordination constructs range from explicit mutexs in the
  source code to thread-safe types such as Java's =AtomicInteger=.
  + Richer thread-safe data structures will be seen later: efficient
    thread-safe lists and maps.
    + Classic Java types such as Vector and Hashtable are thread-safe,
      but inefficient.
+ Thread /synchronization/ includes not just coordination to avoid
  race conditions and deadlock, but also cooperation to boost
  performance:
  + Having a thread wait is a quiet state is better than having a
    thread use up resources trying to gain a lock.
  + The StackTF example in Java illustrates with waiting and
    notifying.
+ The =multithreading_server= highlights multithreading as a concurrency mechanism with these upsides:
  + The /division of labor/ or /separation of concerns/ between a
    /listening/ thread and /request handlers/ prevents the disaster of
    having a hung request interfere with others.
  + On a multiprocessor host, the /one-thread-per-request/ model can
    lead to true parallelism.
  + The example illustrates the concurrent programming style of
    real-world web servers such as Tomcat and Jetty.
+ The =multithreading_server= underscores that local variables (and
  parameters) are thread-safe: the idea of a pure function/.
  + Modern systems allocate separate stack storage per thread, and it's the stack that holds local variables
      and params by default.
** Exercises
vgl. Datei =exercise6.txt=
*** A thread pool exercise in C
*** A synchronization with cooperation exercise in Java
* Thread-Sicherheit -- Höherwertige Concurrent Types in Java
# original: Thread-Safety And High-Level Concurrent Types In Java
# Chapter 7 
** Moving beyond explicit thread management: high-level concurrent data types in Java
# original: Thread Safety Through High-Level Thread-Safe Data Types
+ =java.util.concurrent.atomic= toolkit to support thread-safe,
  lock-free programming for counters and the like. The types include:
  + =AtomicInteger=
  + =AtomicIntegerArray=
  + =AtomicLong=
  + =AtomicLongArray=
  + Here's a sketch of how an /atomic counter/ might be implemented:
    #+BEGIN_SRC java
public final class Counter { 
   private long value = 0;  // initialized for emphasis
   public synchronized long getValue() { return value; }
   public synchronized long increment() {
      if (value == Long.MAX_VALUE)
        throw new IllegalStateException("Counter overflow");
      return ++value;
   }
}
    #+END_SRC
+ For simplicity, a /retrieval/ operation is a /read/ operation: it
  has no side-effects.  An /update/ operation has side-effects: it
  changes the data structure.
+ =java.util.concurrent.ConcurrentHashMap=
  + Same functionality as the ancient =Hashtable=, but highly efficient
    + The map is partitioned: for example, an update locks only part
      of the map.  Two updates could occur at the same time if in
      different partitions.
    + Retrieval operations generally don't block.
    + The whole map cannot be locked in any case.
+ =java.util.concurrent.CopyOnWriteArrayList=
  + Update operations cause a copy of the underlying array to be made.
    + In effect, an immutable data structure in the spirt of Clojure.
+ =java.util.concurrent.BlockingQueue= interface
  + A retrieval waits for the queue to become non-empty before
    retrieving the 1st element.
  + Various implementations, e.g., =ArrayBlockingQueue= and
    =PriorityBlockingQueue=
+ Executors and thread pools
  + The Executor interface provides a single method, execute, designed
    to replace the old Thread idiom.  For example, if reference
    =runnable= points to a Runnable object and =exec= to an Executor,
    then
    : new Thread(runnable).start();  // create a new Thread to run runnable
    becomes
    : exec.execute(runnable);        // may use an already existing worker thread to run runnable
  + Thread pools
    + Most executor implementations use thread pools, which hold /worker threads/.
      + A single worker might be reused to execute many different tasks.
      + Eliminates cost of continually creating and destroying threads.
+ Fork/Join as an Executor service
  + The Fork/Join framework implements the =ExecutorService= interface
    in a way meant to take full advantage of a multiple-processor
    machine.
  + Designed for work on recursive structures: structures such as
    trees whose subparts are also, in this case, (sub)trees. Here's a
    tree representation of the expression =(A * B) + (C + D)=:
    #+BEGIN_EXAMPLE
          +            ## root of tree with two subtrees
         / \
        /   \	
       *     +         ## roots of two subtrees
      / \   / \ 
     A   B C   D       ## 'leaf' nodes: no subtrees below
    #+END_EXAMPLE
   + The framework distributes tasks to workers from a thread pool,
     but workers that run out of something to do can 'steal' work from
     some other thread: highly cooperative task management.
** The Blocking Queue Example in Java
