Vorlesung/ParProg-Multithreading.html
<div id="outline-container-orgb07a2a0" class="outline-4">
<h4 id="orgb07a2a0">Using the Shell</h4>
<div class="outline-text-4" id="text-orgb07a2a0">
<div class="org-src-container">
<pre class="src src-shell">bash-3.2$ java MainTS
82 pushed at 0
82 popped at 0
68 pushed at 0
15 pushed at 1
15 popped at 1
31 pushed at 1
31 popped at 1
68 popped at 0
46 pushed at 0
31 pushed at 1
31 popped at 1
61 pushed at 1
75 pushed at 2
75 popped at 2
82 pushed at 2
82 popped at 2
80 pushed at 2
72 pushed at 3
72 popped at 3
24 pushed at 3
12 pushed at 4
12 popped at 4
24 popped at 3
94 pushed at 3
1 pushed at 4
1 popped at 4
...
  ^C ^Cbash-3.2$ </pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge208879" class="outline-3">
<h3 id="orge208879">The Multithreading Web Server</h3>
<div class="outline-text-3" id="text-orge208879">
<p>
&#x2026; in C
</p>
<ul class="org-ul">
<li>vgl. Datei <code>threading_server.c</code></li>
<li>wird hier vorerst nicht behandelt</li>
</ul>
</div>
</div>
<div id="outline-container-org232ab0d" class="outline-3">
<h3 id="org232ab0d">Wrapup of thread synchronization as coordination and coooperation</h3>
<div class="outline-text-3" id="text-org232ab0d">
<ul class="org-ul">
<li>Thread coordination constructs range from explicit mutexs in the
source code to thread-safe types such as Java's <code>AtomicInteger</code>.
<ul class="org-ul">
<li>Richer thread-safe data structures will be seen later: efficient
thread-safe lists and maps.
<ul class="org-ul">
<li>Classic Java types such as Vector and Hashtable are thread-safe,
but inefficient.</li>
</ul></li>
</ul></li>
<li>Thread <i>synchronization</i> includes not just coordination to avoid
race conditions and deadlock, but also cooperation to boost
performance:
<ul class="org-ul">
<li>Having a thread wait is a quiet state is better than having a
thread use up resources trying to gain a lock.</li>
<li>The StackTF example in Java illustrates with waiting and
notifying.</li>
</ul></li>
<li>The <code>multithreading_server</code> highlights multithreading as a concurrency mechanism with these upsides:
<ul class="org-ul">
<li>The <i>division of labor</i> or <i>separation of concerns</i> between a
<i>listening</i> thread and <i>request handlers</i> prevents the disaster of
having a hung request interfere with others.</li>
<li>On a multiprocessor host, the <i>one-thread-per-request</i> model can
lead to true parallelism.</li>
<li>The example illustrates the concurrent programming style of
real-world web servers such as Tomcat and Jetty.</li>
</ul></li>
<li>The <code>multithreading_server</code> underscores that local variables (and
parameters) are thread-safe: the idea of a pure function/.
<ul class="org-ul">
<li>Modern systems allocate separate stack storage per thread, and it's the stack that holds local variables
and params by default.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org238d714" class="outline-3">
<h3 id="org238d714">Exercises</h3>
<div class="outline-text-3" id="text-org238d714">
<p>
vgl. Datei <code>exercise6.txt</code>
</p>
</div>
<div id="outline-container-org23b9cbd" class="outline-4">
<h4 id="org23b9cbd">A thread pool exercise in C</h4>
</div>
<div id="outline-container-orgc826402" class="outline-4">
<h4 id="orgc826402">A synchronization with cooperation exercise in Java</h4>
</div>
</div>
</div>
<div id="outline-container-org47e4c4b" class="outline-2">
<h2 id="org47e4c4b">Thread-Sicherheit &#x2013; Hherwertige Concurrent Types in Java</h2>
<div class="outline-text-2" id="text-org47e4c4b">
</div>
<div id="outline-container-org215b936" class="outline-3">
<h3 id="org215b936">Moving beyond explicit thread management: high-level concurrent data types in Java</h3>
<div class="outline-text-3" id="text-org215b936">
<ul class="org-ul">
<li><code>java.util.concurrent.atomic</code> toolkit to support thread-safe,
lock-free programming for counters and the like. The types include:
<ul class="org-ul">
<li><code>AtomicInteger</code></li>
<li><code>AtomicIntegerArray</code></li>
<li><code>AtomicLong</code></li>
<li><code>AtomicLongArray</code></li>
<li><p>
Here's a sketch of how an <i>atomic counter</i> might be implemented:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">final</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Counter</span> <span style="color: #707183;">{</span> 
   <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">value</span> = 0;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">initialized for emphasis</span>
   <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">long</span> <span style="color: #006699;">getValue</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">return</span> value; <span style="color: #7388D6;">}</span>
   <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">long</span> <span style="color: #006699;">increment</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
      <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>value == <span style="color: #D0372D;">Long</span>.MAX_VALUE<span style="color: #909183;">)</span>
        <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">IllegalStateException</span><span style="color: #909183;">(</span><span style="color: #008000;">"Counter overflow"</span><span style="color: #909183;">)</span>;
      <span style="color: #0000FF;">return</span> ++value;
   <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div></li>
</ul></li>
<li>For simplicity, a <i>retrieval</i> operation is a <i>read</i> operation: it
has no side-effects.  An <i>update</i> operation has side-effects: it
changes the data structure.</li>
<li><code>java.util.concurrent.ConcurrentHashMap</code>
<ul class="org-ul">
<li>Same functionality as the ancient <code>Hashtable</code>, but highly efficient
<ul class="org-ul">
<li>The map is partitioned: for example, an update locks only part
of the map.  Two updates could occur at the same time if in
different partitions.</li>
<li>Retrieval operations generally don't block.</li>
<li>The whole map cannot be locked in any case.</li>
</ul></li>
</ul></li>
<li><code>java.util.concurrent.CopyOnWriteArrayList</code>
<ul class="org-ul">
<li>Update operations cause a copy of the underlying array to be made.
<ul class="org-ul">
<li>In effect, an immutable data structure in the spirt of Clojure.</li>
</ul></li>
</ul></li>
<li><code>java.util.concurrent.BlockingQueue</code> interface
<ul class="org-ul">
<li>A retrieval waits for the queue to become non-empty before
retrieving the 1st element.</li>
<li>Various implementations, e.g., <code>ArrayBlockingQueue</code> and
<code>PriorityBlockingQueue</code></li>
</ul></li>
<li>Executors and thread pools
<ul class="org-ul">
<li><p>
The Executor interface provides a single method, execute, designed
to replace the old Thread idiom.  For example, if reference
<code>runnable</code> points to a Runnable object and <code>exec</code> to an Executor,
then
</p>
<pre class="example">
new Thread(runnable).start();  // create a new Thread to run runnable

</pre>
<p>
becomes
</p>
<pre class="example">
exec.execute(runnable);        // may use an already existing worker thread to run runnable

</pre></li>
<li>Thread pools
<ul class="org-ul">
<li>Most executor implementations use thread pools, which hold <i>worker threads</i>.
<ul class="org-ul">
<li>A single worker might be reused to execute many different tasks.</li>
<li>Eliminates cost of continually creating and destroying threads.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Fork/Join as an Executor service
<ul class="org-ul">
<li>The Fork/Join framework implements the <code>ExecutorService</code> interface
in a way meant to take full advantage of a multiple-processor
machine.</li>
<li><p>
Designed for work on recursive structures: structures such as
trees whose subparts are also, in this case, (sub)trees. Here's a
tree representation of the expression <code>(A * B) + (C + D)</code>:
</p>
<pre class="example">
          +            ## root of tree with two subtrees
         / \
        /   \	
       *     +         ## roots of two subtrees
      / \   / \ 
     A   B C   D       ## 'leaf' nodes: no subtrees below
</pre>
<ul class="org-ul">
<li>The framework distributes tasks to workers from a thread pool,
but workers that run out of something to do can 'steal' work from
some other thread: highly cooperative task management.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org18821c7" class="outline-3">
<h3 id="org18821c7">The Blocking Queue Example in Java</h3>
