Vorlesung/ParProg-Multithreading.html
<div class="outline-text-3" id="text-org18821c7">
</div><div id="outline-container-org3f782fd" class="outline-4">
<h4 id="org3f782fd">Overview</h4>
<div class="outline-text-4" id="text-org3f782fd">
<p>
A <code>BlockingQueue</code> example: a thread-safe data structure
</p>

<ul class="org-ul">
<li>The interface <code>java.util.concurrent.BlockingQueue</code> has several standard implementations, including
<code>java.util.concurrent.SynchronousQueue</code>
<ul class="org-ul">
<li>This implementation is <i>synchronous</i> in that an <code>insert</code> operation
blocks (waits) for a corresponding <code>remove</code> operation.
<ul class="org-ul">
<li>In different terms, a <code>SynchronousQueue</code> does no buffering and,
in this sense, acts like a pipe. Indeed, the documentation
characterizes this queue as an <i>empty collection</i>.</li>
<li>By contrast, an <code>ArrayBlockingQueue</code> does have a buffering capacity.</li>
</ul></li>
<li><p>
Here's a depiction, using the familar pipe symbol | to represent
the <code>SynchronousQueue</code>, with the producer and consumer as threads:
</p>
<pre class="example">
                  item    item
  producer thread------&gt;|------&gt;consumer thread
                SynchronousQueue
</pre></li>
<li>The SynchronousQueue is thread-safe.</li>
</ul></li>
<li><p>
The <code>java.lang.Thread class</code> implements the <code>java.lang.Runnable</code> interface, which defines one method:
</p>
<pre class="example">
public void run();

</pre>
<p>
The Thread class has an empty implemenation (<i>adapter</i> pattern):
</p>
<pre class="example">
public void run() { }  // returns immediately

</pre>
<ul class="org-ul">
<li>In our example, the Producer and Consumer classes could either
subclass <code>Thread</code> or implement <code>Runnable</code>.
<ul class="org-ul">
<li>For variety, this example takes the 'implement Runnable' approach.</li>
</ul></li>
<li>Program structure
<ul class="org-ul">
<li>The <code>ProducerConsumerQueue</code> class has <code>main</code>, which creates a
<code>SynchronousQueue</code> named <code>dropbox</code>.</li>
<li>The <code>Driver</code> likewise creates two <code>Producer</code> threads and a
<code>Consumer</code> thread, each with access to the <code>dropbox</code>.</li>
<li>The <code>Producer</code> threads insert Strings into the queue, and the
<code>Consumer</code> thread removes Strings from the queue one at a time for
printing.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
