Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org3f91909" class="outline-4">
<h4 id="org3f91909">Java Code</h4>
<div class="outline-text-4" id="text-org3f91909">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** javac ProducerConsumerQueue.java</span>
<span style="color: #036A07;">    java ProducerConsumerQueue</span>
<span style="color: #036A07;">*/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">BlockingQueue</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">SynchronousQueue</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Random</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ProducerConsumerQueue</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">BlockingQueue</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">dropbox</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SynchronousQueue</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;()</span>;  <span style="color: #036A07;">/** line 1 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Producer</span><span style="color: #709870;">(</span>dropbox<span style="color: #709870;">)</span><span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                       <span style="color: #036A07;">/** line 2 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Consumer</span><span style="color: #709870;">(</span>dropbox, 12<span style="color: #709870;">)</span><span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                   <span style="color: #036A07;">/** line 3 **/</span>
        <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Thread</span><span style="color: #909183;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Producer</span><span style="color: #709870;">(</span>dropbox<span style="color: #709870;">)</span><span style="color: #909183;">)</span>.start<span style="color: #909183;">()</span>;                       <span style="color: #036A07;">/** line 4 **/</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Producer</span> <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">Runnable</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">BlockingQueue</span><span style="color: #7388D6;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #7388D6;">&gt;</span> <span style="color: #BA36A5;">dropbox</span>;

    <span style="color: #006699;">Producer</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">BlockingQueue</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">dropbox</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">this</span>.dropbox = dropbox;
    <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                                                  <span style="color: #036A07;">/** line 5 **/</span>
        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">importantInfo</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> = <span style="color: #909183;">{</span>
        <span style="color: #008000;">"Managed holistic contingency will grow killer action-items."</span>,
        <span style="color: #008000;">"Vision-oriented zero administration time-frame will generate back-end interfaces."</span>,
        <span style="color: #008000;">"Triple-buffered scalable services will productize visionary infomediaries."</span>,
        <span style="color: #008000;">"Reactive radical knowledge base will aggregate extensible vortals."</span>,
        <span style="color: #008000;">"Face to face client-server pricing structure will whiteboard robust communities."</span>,
        <span style="color: #008000;">"Future-proofed 5th generation protocols will strategize web-enabled networks."</span>
        <span style="color: #909183;">}</span>;
        <span style="color: #0000FF;">try</span> <span style="color: #909183;">{</span>
            <span style="color: #0000FF;">for</span> <span style="color: #709870;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">info</span> : importantInfo<span style="color: #709870;">)</span> dropbox.put<span style="color: #709870;">(</span>info<span style="color: #709870;">)</span>;         <span style="color: #036A07;">/** line 6 **/</span>
        <span style="color: #909183;">}</span> <span style="color: #0000FF;">catch</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #909183;">)</span> <span style="color: #909183;">{}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Consumer</span> <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">Runnable</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">BlockingQueue</span><span style="color: #7388D6;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #7388D6;">&gt;</span> <span style="color: #BA36A5;">dropbox</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">maxTakes</span>;

    <span style="color: #006699;">Consumer</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">BlockingQueue</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">dropbox</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">maxTakes</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">this</span>.dropbox = dropbox;
        <span style="color: #0000FF;">this</span>.maxTakes = maxTakes;
    <span style="color: #7388D6;">}</span>

    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">Random</span> <span style="color: #BA36A5;">random</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Random</span><span style="color: #909183;">()</span>;
        <span style="color: #0000FF;">try</span> <span style="color: #909183;">{</span>
            <span style="color: #0000FF;">for</span> <span style="color: #709870;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #0000FF;">this</span>.<span style="color: #6434A3;">maxTakes</span>; i++<span style="color: #709870;">)</span> <span style="color: #709870;">{</span>                    <span style="color: #036A07;">/** line 7 **/</span>
                <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">message</span> = dropbox.take<span style="color: #907373;">()</span>;                         <span style="color: #036A07;">/** line 8 **/</span>
                System.out.format<span style="color: #907373;">(</span><span style="color: #008000;">"Message received: %s\n"</span>, message<span style="color: #907373;">)</span>;
                Thread.sleep<span style="color: #907373;">(</span>random.nextInt<span style="color: #6276BA;">(</span>3000<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>;                      <span style="color: #036A07;">/** line 9 **/</span>
            <span style="color: #709870;">}</span>
        <span style="color: #909183;">}</span> <span style="color: #0000FF;">catch</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">InterruptedException</span> <span style="color: #BA36A5;">e</span><span style="color: #909183;">)</span> <span style="color: #909183;">{}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org851b13b" class="outline-4">
<h4 id="org851b13b">Using the Shell</h4>
<div class="outline-text-4" id="text-org851b13b">
<div class="org-src-container">
<pre class="src src-shell">bash-3.2$ javac ProducerConsumerQueue.java 
bash-3.2$ java ProducerConsumerQueue
Message received: Managed holistic contingency will grow killer action-items.
Message received: Vision-oriented zero administration time-frame will generate back-end interfaces.
Message received: Triple-buffered scalable services will productize visionary infomediaries.
Message received: Reactive radical knowledge base will aggregate extensible vortals.
Message received: Face to face client-server pricing structure will whiteboard robust communities.
Message received: Future-proofed 5th generation protocols will strategize web-enabled networks.
Message received: Managed holistic contingency will grow killer action-items.
Message received: Vision-oriented zero administration time-frame will generate back-end interfaces.
Message received: Triple-buffered scalable services will productize visionary infomediaries.
Message received: Reactive radical knowledge base will aggregate extensible vortals.
Message received: Face to face client-server pricing structure will whiteboard robust communities.
Message received: Future-proofed 5th generation protocols will strategize web-enabled networks.
bash-3.2$ </pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb6743e2" class="outline-3">
<h3 id="orgb6743e2">The Semaphore/Executor Example in Java</h3>
