Vorlesung/ParProg-Multithreading.html
<div class="outline-text-3" id="text-orgb6743e2">
</div><div id="outline-container-org77fbd95" class="outline-4">
<h4 id="org77fbd95">Overview</h4>
<div class="outline-text-4" id="text-org77fbd95">
<ul class="org-ul">
<li>Semaphores versus mutexes:
<ul class="org-ul">
<li>A semaphore allows 'counted access' to a resource, and a mutex is
the special case for count == 1
<ul class="org-ul">
<li>A semaphore might allow 10 threads to hit a protected resource,
but not 11.</li>
<li>A mutex would allow 1 thread at most to hit a protected resource.</li>
</ul></li>
<li>Semphores that allow 'counted access' are called <i>counting semaphores</i>.</li>
</ul></li>
<li><p>
Executor service: the service builds and then manages a thread pool,
drawing upon <i>worker threads</i> in the pool as needed. The difference
between
</p>
<pre class="example">
new Thread(runnable).start();  // explicitly create and start a Thread to handle the task

</pre>
<p>
and
</p>
<pre class="example">
exec.execute(runnable);        // get a Thread from a pool to handle the task

</pre>
<ul class="org-ul">
<li>Various options for how the Executor can work: use the same thread
for a given task, use any thread from a pool for a given task.</li>
</ul></li>
<li>The <code>SkiRental</code> application to introduce the Executor service and Semaphores
<ul class="org-ul">
<li>The <code>SkiPair</code> class represents a pair of skis to be rented.
<ul class="org-ul">
<li>Properties are <code>name</code> and <code>inUse=</code>.</li>
</ul></li>
<li>The <code>SkisForRent</code> class represents the inventory of SkiPairs
available for rent.
<ul class="org-ul">
<li>A pair of synchronized methods <code>getSkiPair()</code> and
<code>isReturnable(SkiPair)</code> safeguard critical section code.</li>
<li>Other methods support the inventory bookkeeping.</li>
<li>To make sure the inventory never runs dry, <i>semaphore count</i> &lt; <i>inventory count</i></li>
<li>Messages about renting out and returning ski pairs are logged.</li>
</ul></li>
</ul></li>
<li>Each rented <code>SkiPair</code> is simulated as a <code>Runnable</code>, whose duration
represents the amount of time spent skiing.
<ul class="org-ul">
<li>For robustness, the executor service has a thread pool greater by
1 in size than the inventory.</li>
</ul></li>
</ul>
</div>
</div>
