Vorlesung/ParProg-Multithreading.html
<div id="outline-container-orgb840baa" class="outline-4">
<h4 id="orgb840baa">Java Code</h4>
<div class="outline-text-4" id="text-orgb840baa">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** javac Semaphores.java</span>
<span style="color: #036A07;">    java Semaphores</span>

<span style="color: #036A07;">    This program uses an ExecutorService and Semaphores</span>
<span style="color: #036A07;">    in a simulation of a ski rental service.</span>
<span style="color: #036A07;">*/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">Executors</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">ExecutorService</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">Semaphore</span>;                                         <span style="color: #036A07;">/** line 1 **/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Random</span>;

<span style="color: #0000FF;">final</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">SkiPair</span> <span style="color: #707183;">{</span>                                                          <span style="color: #036A07;">/** line 2 **/</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">boolean</span> <span style="color: #BA36A5;">inUse</span>;

    <span style="color: #0000FF;">public</span> <span style="color: #006699;">SkiPair</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">boolean</span> <span style="color: #BA36A5;">inUse</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> 
        setName<span style="color: #909183;">(</span>name<span style="color: #909183;">)</span>; 
        setInUse<span style="color: #909183;">(</span>inUse<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">getName</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>. name; <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setName</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.name = name; <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">setInUse</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">boolean</span> <span style="color: #BA36A5;">inUse</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">this</span>.inUse = inUse;  <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">isInUse</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">this</span>.inUse; <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">final</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">SkisForRent</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">MaxSkiPairs</span> = 150;                                    <span style="color: #036A07;">/** line 3 **/</span>
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">static</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">MinInStock</span> = 5;                                      <span style="color: #036A07;">/** line 4 **/</span>
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">Semaphore</span> <span style="color: #BA36A5;">semaphore</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Semaphore</span><span style="color: #7388D6;">(</span>MaxSkiPairs - MinInStock<span style="color: #7388D6;">)</span>;  <span style="color: #036A07;">/** line 5 **/</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">SkiPair</span><span style="color: #7388D6;">[</span> <span style="color: #7388D6;">]</span> <span style="color: #BA36A5;">inventory</span>;

    <span style="color: #006699;">SkisForRent</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        inventory = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SkiPair</span><span style="color: #909183;">[</span>MaxSkiPairs<span style="color: #909183;">]</span>;
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">MaxSkiPairs</span>; i++<span style="color: #909183;">)</span> inventory<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SkiPair</span><span style="color: #909183;">(</span><span style="color: #008000;">"skiPair-"</span> + i, 
                                                                         <span style="color: #D0372D;">false</span><span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">SkiPair</span> <span style="color: #006699;">rentSkiPair</span><span style="color: #7388D6;">()</span> <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> <span style="color: #7388D6;">{</span>
        semaphore.acquire<span style="color: #909183;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">get the ticket (acquire() is thread-safe       /** line 6 **/</span>
        <span style="color: #0000FF;">return</span> getSkiPair<span style="color: #909183;">()</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">use tick to retrieve pair                      /** line 7 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">returnSkiPair</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">SkiPair</span> <span style="color: #BA36A5;">sp</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>isReturnable<span style="color: #709870;">(</span>sp<span style="color: #709870;">)</span><span style="color: #909183;">)</span> semaphore.release<span style="color: #909183;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">release() is thread-safe  /** line 8 **/</span>
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">protected</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">SkiPair</span> <span style="color: #006699;">getSkiPair</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                               <span style="color: #036A07;">/** line 9 **/</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">SkiPair</span> <span style="color: #BA36A5;">sp</span> : inventory<span style="color: #909183;">)</span> 
            <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>!sp.isInUse<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
                sp.setInUse<span style="color: #709870;">(</span><span style="color: #D0372D;">true</span><span style="color: #709870;">)</span>;
                <span style="color: #0000FF;">return</span> sp;
            <span style="color: #909183;">}</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">null</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">out of luck</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">protected</span> <span style="color: #0000FF;">synchronized</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">isReturnable</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">SkiPair</span> <span style="color: #BA36A5;">sp</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>                   <span style="color: #036A07;">/** line 10 **/</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>sp.isInUse<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            sp.setInUse<span style="color: #709870;">(</span><span style="color: #D0372D;">false</span><span style="color: #709870;">)</span>;
            <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">true</span>;
        <span style="color: #909183;">}</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">false</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Semaphores</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">Random</span> <span style="color: #BA36A5;">rand</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Random</span><span style="color: #909183;">()</span>;
        <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">SkisForRent</span> <span style="color: #BA36A5;">sfr</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SkisForRent</span><span style="color: #909183;">()</span>;
        
        <span style="color: #6434A3;">Runnable</span> <span style="color: #BA36A5;">runnable</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Runnable</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>                                    <span style="color: #036A07;">/** line 11 **/</span>
                <span style="color: #D0372D;">@Override</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">run</span><span style="color: #709870;">()</span> <span style="color: #709870;">{</span>
                    <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span> = Thread.currentThread<span style="color: #907373;">()</span>.getName<span style="color: #907373;">()</span>;
                    <span style="color: #0000FF;">try</span> <span style="color: #907373;">{</span>
                        <span style="color: #0000FF;">while</span> <span style="color: #6276BA;">(</span><span style="color: #D0372D;">true</span><span style="color: #6276BA;">)</span> <span style="color: #6276BA;">{</span>                                          <span style="color: #036A07;">/** line 12 **/</span>
                            <span style="color: #6434A3;">SkiPair</span> <span style="color: #BA36A5;">sp</span> = sfr.rentSkiPair<span style="color: #858580;">()</span>;
                            System.out.printf<span style="color: #858580;">(</span><span style="color: #008000;">"%s renting %s%n"</span>, name, sp.getName<span style="color: #80A880;">()</span><span style="color: #858580;">)</span>;
                            Thread.sleep<span style="color: #858580;">(</span>rand.nextInt<span style="color: #80A880;">(</span>2000<span style="color: #80A880;">)</span><span style="color: #858580;">)</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">skiing</span>
                            System.out.printf<span style="color: #858580;">(</span><span style="color: #008000;">"%s returning %s%n"</span>, name, sp.getName<span style="color: #80A880;">()</span><span style="color: #858580;">)</span>;
                            sfr.returnSkiPair<span style="color: #858580;">(</span>sp<span style="color: #858580;">)</span>;
                        <span style="color: #6276BA;">}</span>
                    <span style="color: #907373;">}</span>
                    <span style="color: #0000FF;">catch</span> <span style="color: #907373;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #907373;">)</span> <span style="color: #907373;">{</span> System.err.println<span style="color: #6276BA;">(</span>e<span style="color: #6276BA;">)</span>; <span style="color: #907373;">}</span>
                <span style="color: #709870;">}</span>
            <span style="color: #909183;">}</span>;
        <span style="color: #6434A3;">ExecutorService</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">executors</span> =                                          <span style="color: #036A07;">/** line 13 **/</span>
            <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ExecutorService</span><span style="color: #909183;">[</span><span style="color: #D0372D;">SkisForRent</span>.MaxSkiPairs + 1<span style="color: #909183;">]</span>;                       
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">ExecutorService</span> <span style="color: #BA36A5;">executor</span> : executors<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            executor = Executors.newSingleThreadExecutor<span style="color: #709870;">()</span>;                     <span style="color: #036A07;">/** line 14 **/</span>
            executor.execute<span style="color: #709870;">(</span>runnable<span style="color: #709870;">)</span>;                                         <span style="color: #036A07;">/** line 15 **/</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
