Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org4ebf207" class="outline-4">
<h4 id="org4ebf207">Using the Shell</h4>
<div class="outline-text-4" id="text-org4ebf207">
<div class="org-src-container">
<pre class="src src-shell">bash-3.2$ javac Semaphores.java 
bash-3.2$ java Semaphores
pool-1-thread-1 renting skiPair-0
pool-145-thread-1 renting skiPair-144
pool-144-thread-1 renting skiPair-143
pool-143-thread-1 renting skiPair-142
pool-142-thread-1 renting skiPair-141
pool-141-thread-1 renting skiPair-140
...
pool-7-thread-1 renting skiPair-6
pool-6-thread-1 renting skiPair-5
pool-5-thread-1 renting skiPair-4
pool-4-thread-1 renting skiPair-3
pool-3-thread-1 renting skiPair-2
pool-2-thread-1 renting skiPair-1
pool-136-thread-1 returning skiPair-135
pool-82-thread-1 returning skiPair-81
pool-34-thread-1 returning skiPair-33
pool-124-thread-1 returning skiPair-123
pool-126-thread-1 returning skiPair-125
...
pool-104-thread-1 renting skiPair-103
pool-77-thread-1 renting skiPair-76
pool-68-thread-1 renting skiPair-67
pool-79-thread-1 renting skiPair-78
pool-145-thread-1 renting skiPair-144
pool-35-thread-1 renting skiPair-34
pool-87-thread-1 renting skiPair-86
pool-106-thread-1 renting skiPair-105
pool-85-thread-1 renting skiPair-84
...
pool-126-thread-1 renting skiPair-125
pool-124-thread-1 renting skiPair-123
pool-34-thread-1 renting skiPair-33
pool-82-thread-1 renting skiPair-81
pool-136-thread-1 renting skiPair-135
pool-89-thread-1 returning skiPair-88
pool-7-thread-1 returning skiPair-6
pool-96-thread-1 returning skiPair-95
pool-144-thread-1 renting skiPair-143
pool-96-thread-1 renting skiPair-95
pool-7-thread-1 renting skiPair-6
pool-89-thread-1 renting skiPair-88
pool-106-thread-1 returning skiPair-105
pool-106-thread-1 renting skiPair-105
pool-138-thread-1 returning skiPair-137
pool-138-thread-1 renting skiPair-137
pool-57-thread-1 returning skiPair-56
pool-57-thread-1 renting skiPair-56
pool-78-thread-1 returning skiPair-77
pool-78-thread-1 renting skiPair-77
pool-115-thread-1 returning skiPair-114
...
pool-131-thread-1 renting skiPair-130
pool-113-thread-1 returning skiPair-112
pool-113-thread-1 renting skiPair-112
pool-136-thread-1 returning skiPair-135
pool-136-thread-1 renting skiPair-135
pool-73-thread-1 returning skiPair-72
pool-73-thread-1 renting skiPair-72
pool-98-thread-1 returning skiPair-97
pool-98-thread-1 renting skiPair-97
pool-43-thread-1 returning skiPair-42
  ^C ^Cbash-3.2$ </pre>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf3d482f" class="outline-3">
<h3 id="orgf3d482f">The Fork-Join Framework in Java</h3>
<div class="outline-text-3" id="text-orgf3d482f">
</div><div id="outline-container-org650a5da" class="outline-4">
<h4 id="org650a5da">Overview of the FileSearcher program</h4>
<div class="outline-text-4" id="text-org650a5da">
<ul class="org-ul">
<li>An example that uses the fork/join framework meant to encourage the
partititioning of a problem into subproblems, which threads
executing on separate processors handling each subproblem.
<ul class="org-ul">
<li>The thread management &#x2013; the multithreading &#x2013; is under the hood for a
very high-level API.</li>
<li>Suited for processing recursive structures such as trees whose
parts are likewise trees (that is, subtrees).</li>
<li>The program defines a <i>recursive task</i> (in this case, searching
part of the local file sysem), and indicates with calls to <code>fork</code>
where a suitable subtask begins.</li>
</ul></li>
<li>The <code>FileSearcher</code> searches the file system (starting at the root of
some tree) for files with a specified extension.
<ul class="org-ul">
<li>A traditional Unix-like system has / as the root of the whole
system, whereas Windows may have multiple roots such as <code>C:\</code>, <code>D:\</code>,
<code>E:\</code>, and so on.</li>
<li>The FileSearcher eventually returns a list of the file names with
the specified extension.</li>
</ul></li>
<li>The 'fork' in the fork/join API announces a subproblem suited for a
new thread. The 'join' aggregates results from the work of the
threads.</li>
<li>Base case and recursive case in the <code>FileSearcher</code>
<ul class="org-ul">
<li>Base case: a search-thread finds a file with the desired extension
&#x2013; a non-directory file rather than a directory&#x2013;and adds this
file to the list.</li>
<li>Recursive case: a search-thread finds a (sub)directory, which is
suitable for separate processing.</li>
</ul></li>
</ul>
</div>
</div>
