Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org1f78a44" class="outline-4">
<h4 id="org1f78a44">Java Code of <code>FileSearcher</code></h4>
<div class="outline-text-4" id="text-org1f78a44">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** javac FileSearcher.java</span>
<span style="color: #036A07;">    java MainFS</span>

<span style="color: #036A07;">    The program searches from the user's home directory for</span>
<span style="color: #036A07;">    files extending with '.txt' as the extension. The list of</span>
<span style="color: #036A07;">    such files is printed to the screen.</span>
<span style="color: #036A07;">*/</span>

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">File</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">ArrayList</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">List</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Collection</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">RecursiveTask</span>;                                     <span style="color: #036A07;">/** line 0 **/</span>
 
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">FileSearcher</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">RecursiveTask</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">List</span><span style="color: #7388D6;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #7388D6;">&gt;</span><span style="color: #707183;">&gt;</span> <span style="color: #707183;">{</span>                <span style="color: #036A07;">/** line 1 **/</span>
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">path</span>;
    <span style="color: #0000FF;">private</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">extension</span>;
 
    <span style="color: #0000FF;">public</span> <span style="color: #006699;">FileSearcher</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">path</span>, <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">extension</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>                       <span style="color: #036A07;">/** line 2 **/</span>
        <span style="color: #0000FF;">this</span>.path = path;
        <span style="color: #0000FF;">this</span>.extension = extension;
    <span style="color: #7388D6;">}</span>
    
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">List</span><span style="color: #7388D6;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #7388D6;">&gt;</span> <span style="color: #006699;">compute</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                                            <span style="color: #036A07;">/** line 3 **/</span>
        <span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">listOfFileNames</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;()</span>;
        <span style="color: #6434A3;">File</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">files</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">File</span><span style="color: #909183;">(</span>path<span style="color: #909183;">)</span>.listFiles<span style="color: #909183;">()</span>;                            <span style="color: #036A07;">/** line 4 **/</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>files == <span style="color: #D0372D;">null</span><span style="color: #909183;">)</span> <span style="color: #0000FF;">return</span> listOfFileNames; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">base case                /** line 5 **/</span>

        <span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">FileSearcher</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">tasks</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">FileSearcher</span><span style="color: #909183;">&gt;()</span>;              <span style="color: #036A07;">/** line 6 **/</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">File</span> <span style="color: #BA36A5;">file</span> : files<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                                              <span style="color: #036A07;">/** line 7 **/</span>
            <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">absolutePath</span> = file.getAbsolutePath<span style="color: #709870;">()</span>;                      <span style="color: #036A07;">/** line 8 **/</span>
            <span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>file.isDirectory<span style="color: #907373;">()</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span>                                          <span style="color: #036A07;">/** line 9 **/</span>
                <span style="color: #6434A3;">FileSearcher</span> <span style="color: #BA36A5;">task</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileSearcher</span><span style="color: #907373;">(</span>absolutePath, extension<span style="color: #907373;">)</span>; <span style="color: #036A07;">/** line 10 **/</span>
                task.fork<span style="color: #907373;">()</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">recursive case                                 /** 1ine 11 **/</span>
                tasks.add<span style="color: #907373;">(</span>task<span style="color: #907373;">)</span>;                                               <span style="color: #036A07;">/** line 12 **/</span>
            <span style="color: #709870;">}</span>
            <span style="color: #0000FF;">else</span> <span style="color: #0000FF;">if</span> <span style="color: #709870;">(</span>file.getName<span style="color: #907373;">()</span>.endsWith<span style="color: #907373;">(</span>extension<span style="color: #907373;">)</span><span style="color: #709870;">)</span>                       <span style="color: #036A07;">/** line 13 **/</span>
                listOfFileNames.add<span style="color: #709870;">(</span>absolutePath<span style="color: #709870;">)</span>;
        <span style="color: #909183;">}</span>
        assembleResults<span style="color: #909183;">(</span>listOfFileNames, tasks<span style="color: #909183;">)</span>;                               <span style="color: #036A07;">/** line 14 **/</span>
        <span style="color: #0000FF;">return</span> listOfFileNames;                                                <span style="color: #036A07;">/** line 15 **/</span>
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">assembleResults</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">list</span>, <span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">FileSearcher</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">tasks</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">FileSearcher</span> <span style="color: #BA36A5;">task</span> : tasks<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #6434A3;">Collection</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #709870;">&gt;</span> <span style="color: #BA36A5;">results</span> = task.join<span style="color: #709870;">()</span>;                          <span style="color: #036A07;">/** line 16 **/</span>
            list.addAll<span style="color: #709870;">(</span>results<span style="color: #709870;">)</span>;                                              <span style="color: #036A07;">/** line 17 **/</span>
        <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">MainFS</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">String</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">list</span> = 
           <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileSearcher</span><span style="color: #909183;">(</span>System.getProperty<span style="color: #709870;">(</span><span style="color: #008000;">"user.home"</span><span style="color: #709870;">)</span>, <span style="color: #008000;">".txt"</span><span style="color: #909183;">)</span>.compute<span style="color: #909183;">()</span>;  <span style="color: #036A07;">/** line 18 **/</span>
        System.out.println<span style="color: #909183;">(</span><span style="color: #008000;">"Files with extension .txt:"</span><span style="color: #909183;">)</span>;
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">string</span> : list<span style="color: #909183;">)</span> System.out.println<span style="color: #909183;">(</span>string<span style="color: #909183;">)</span>;                   <span style="color: #036A07;">/** line 19 **/</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
