Vorlesung/ParProg-Multithreading.html
<div id="outline-container-orgcd02c16" class="outline-4">
<h4 id="orgcd02c16">Demo</h4>
<div class="outline-text-4" id="text-orgcd02c16">
<p>
!!! live demo !!!
</p>
</div>
</div>
</div>
<div id="outline-container-org1fa8e33" class="outline-3">
<h3 id="org1fa8e33">Futures And Callables In Java - A Code Example</h3>
<div class="outline-text-3" id="text-org1fa8e33">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** javac AsyncJob.java</span>
<span style="color: #036A07;">    java MainAJ</span>

<span style="color: #036A07;">    This program illlustrates the Callable interface and the Future interface, the</span>
<span style="color: #036A07;">    latter of which represents the result of an asynchronous computation.</span>
<span style="color: #036A07;">*/</span>

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">ArrayList</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">List</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">Callable</span>;                                 <span style="color: #036A07;">/** line 1 **/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">Future</span>;                                   <span style="color: #036A07;">/** line 2 **/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">ExecutorService</span>;                          <span style="color: #036A07;">/** line 3 **/</span>
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">concurrent</span>.<span style="color: #6434A3;">Executors</span>;
                                   
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">A 'callable' is like a 'runnable' except that the executed</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">method is now 'call' instead of 'run'; a 'callable' can return</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">a value of a specified type, in this case Long.  </span>
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">AsyncJob</span> <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">Callable</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #707183;">&gt;</span> <span style="color: #707183;">{</span>                     <span style="color: #036A07;">/** line 4 **/</span>
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">Long</span> <span style="color: #006699;">call</span><span style="color: #7388D6;">()</span> <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> <span style="color: #7388D6;">{</span>                             <span style="color: #036A07;">/** line 5 **/</span>
        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">sum</span> = 0;
        <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span> = 1000;
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">n</span>; i++<span style="color: #909183;">)</span> sum += i;
        <span style="color: #0000FF;">return</span> sum;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">MainAJ</span> <span style="color: #707183;">{</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">String</span><span style="color: #909183;">[</span> <span style="color: #909183;">]</span> <span style="color: #BA36A5;">args</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">poolSize</span> = 10;
        <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span> = 20000; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">20,000</span>
        
        <span style="color: #6434A3;">ExecutorService</span> <span style="color: #BA36A5;">executor</span> =
            Executors.newFixedThreadPool<span style="color: #909183;">(</span>poolSize<span style="color: #909183;">)</span>;                   <span style="color: #036A07;">/** line 6 **/</span>
        <span style="color: #6434A3;">List</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">Future</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #709870;">&gt;</span><span style="color: #909183;">&gt;</span> <span style="color: #BA36A5;">jobList</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span><span style="color: #909183;">&lt;</span><span style="color: #6434A3;">Future</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #709870;">&gt;</span><span style="color: #909183;">&gt;()</span>;   <span style="color: #036A07;">/** line 7 **/</span>

        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #6434A3;">n</span>; i++<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
            <span style="color: #6434A3;">Callable</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #709870;">&gt;</span> <span style="color: #BA36A5;">job</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">AsyncJob</span><span style="color: #709870;">()</span>;                      <span style="color: #036A07;">/** line 8 **/</span>
            <span style="color: #6434A3;">Future</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #709870;">&gt;</span> <span style="color: #BA36A5;">pendingJob</span> = executor.submit<span style="color: #709870;">(</span>job<span style="color: #709870;">)</span>;           <span style="color: #036A07;">/** line 9 **/</span>
            jobList.add<span style="color: #709870;">(</span>pendingJob<span style="color: #709870;">)</span>;                                  <span style="color: #036A07;">/** line 10 **/</span>
        <span style="color: #909183;">}</span>
        

        <span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">sum</span> = 0;
        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Try to retrieve the results.</span>
        <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">Future</span><span style="color: #709870;">&lt;</span><span style="color: #6434A3;">Long</span><span style="color: #709870;">&gt;</span> <span style="color: #BA36A5;">result</span> : jobList<span style="color: #909183;">)</span> <span style="color: #909183;">{</span>                         <span style="color: #036A07;">/** line 11 **/</span>
            <span style="color: #0000FF;">try</span> <span style="color: #709870;">{</span>
                sum += result.get<span style="color: #907373;">()</span>;                                  <span style="color: #036A07;">/** line 12 **/</span>
            <span style="color: #709870;">}</span> 
            <span style="color: #0000FF;">catch</span> <span style="color: #709870;">(</span><span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span><span style="color: #709870;">)</span> <span style="color: #709870;">{</span> e.printStackTrace<span style="color: #907373;">()</span>; <span style="color: #709870;">}</span> 
        <span style="color: #909183;">}</span>
        executor.shutdown<span style="color: #909183;">()</span>;
        
        System.out.println<span style="color: #909183;">(</span><span style="color: #008000;">"List size: "</span> + jobList.size<span style="color: #709870;">()</span><span style="color: #909183;">)</span>;             
        System.out.println<span style="color: #909183;">(</span><span style="color: #008000;">"Sum: "</span> + sum<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">output (formatted for readability):</span>

<span style="color: #8D8D84; font-style: italic;">   List size:        20,000</span>
<span style="color: #8D8D84; font-style: italic;">   Sum:       9,990,000,000</span>
<span style="color: #8D8D84; font-style: italic;">*/</span></pre>
</pre>
</div>
</div>
