Vorlesung/ParProg-Multithreading.org
** Thread Safety Through Immutable Types And Pure Functions
#+BEGIN_SRC java
/** 
    String example:
    
    String s1 = new String("HI");
    System.out.println(s1);       // HI
    String s2 = s1.toLowerCase(); // original string is unchanged
    System.out.println(s1);       // HI
    System.out.println(s2);       // hi

    ImmutableRGB API:

    ImmutableRGB sg = new ImmutableRGB(112, 128, 144, "SlateGrey");
    ImmutableRGB invert = sg.invert(); // Creates a new instance.
    int colors = sg.getRGB();          // getter only
    String name = sg.getName();        // getter only

    Clojure (http://clojure.org) relies heavily on immutable structures.
 */

final public class ImmutableRGB {                                            /** line 1 **/
    // Values between 0 and 255.
    final private int red;
    final private int green;
    final private int blue;
    final private String name;

    public ImmutableRGB(int red, int green, int blue, String name) {         /** line 2 **/
        check(red, green, blue);
        this.red = red;
        this.green = green;
        this.blue = blue;
        this.name = name;
    }
    
    // Store three 8-bit values in a 32-bit int.
    public int getRGB() {                                                    /** line 3 **/
        return ((red << 16) | (green << 8) | blue);
    }

    public String getName() {
        return name;
    }

    public ImmutableRGB invert() {                                           /** line 4 **/
        return new ImmutableRGB(255 - red,
                       255 - green,
                       255 - blue,
                       "Inverse of " + name);
    }
    private void check(int red,                                              /** line 5 **/
                       int green,
                       int blue) {
        if (red < 0 || red > 255 || green < 0 || green > 255 || blue < 0 || blue > 255) 
            throw new IllegalArgumentException();
    }
}
#+END_SRC
** Zusammenfassung
 Summary of the main themes in the recent code examples

+ producer-consumer pattern using a synchronous queue:
  + In effect, a thread-safe channel from one thread to another.
    + Two producers with one consumer to illustrate the thread safety.
    + The particular queue used in this example acts like a pipe, as there's no buffering.
+ file-searcher: the fork/join framework as a way to 'divide and
  conqueur' recursive tasks
  + Java's fork/join framework allows less busy threads from an
    executor-service to 'steal' work from busier threads.
  + Basic pattern: divide the task into subtasks (etc.), and then
    aggregate the results.
+ semaphores: a resource needs limited access, but not mutual
  exclusion
  + The ski rental example provides 'tickets' (a counting semaphore)
    to dictate how many ski pairs from inventory may be rented out at
    any time
+ Asynchronous multithreading using futures: dispatch a task to a
  thread, and check later for the result.
+ Immutable types and 'pure functions' are inherently thread-safe:
  + There's a cost to immutable types, as mutating operations
    (write-edit-delete) require that a copy be made--and it's the copy
    that's changed, not the original.
  + Pure functions have no side-effects, as they work only with
    parameters and local variables, both of which are thread safe. Is
    this realistic in real-world programming?

# * Options For Thread Synchronization And Cooperation
# Chapter 8 
 Options for thread synchronization (including cooperation) using the
 GO language

...

vorerst auslassen

 
