Vorlesung/ParProg-Multithreading.html
<div id="outline-container-org33de564" class="outline-4">
<h4 id="org33de564">Demo</h4>
<div class="outline-text-4" id="text-org33de564">
<p>
!!! live demo !!!
</p>
</div>
</div>
</div>
<div id="outline-container-org79f8af8" class="outline-3">
<h3 id="org79f8af8">Thread Safety Through Immutable Types And Pure Functions</h3>
<div class="outline-text-3" id="text-org79f8af8">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #036A07;">/** </span>
<span style="color: #036A07;">    String example:</span>
<span style="color: #036A07;">    </span>
<span style="color: #036A07;">    String s1 = new String("HI");</span>
<span style="color: #036A07;">    System.out.println(s1);       // HI</span>
<span style="color: #036A07;">    String s2 = s1.toLowerCase(); // original string is unchanged</span>
<span style="color: #036A07;">    System.out.println(s1);       // HI</span>
<span style="color: #036A07;">    System.out.println(s2);       // hi</span>

<span style="color: #036A07;">    ImmutableRGB API:</span>

<span style="color: #036A07;">    ImmutableRGB sg = new ImmutableRGB(112, 128, 144, "SlateGrey");</span>
<span style="color: #036A07;">    ImmutableRGB invert = sg.invert(); // Creates a new instance.</span>
<span style="color: #036A07;">    int colors = sg.getRGB();          // getter only</span>
<span style="color: #036A07;">    String name = sg.getName();        // getter only</span>

<span style="color: #036A07;">    Clojure (http://clojure.org) relies heavily on immutable structures.</span>
<span style="color: #036A07;"> */</span>

<span style="color: #0000FF;">final</span> <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ImmutableRGB</span> <span style="color: #707183;">{</span>                                            <span style="color: #036A07;">/** line 1 **/</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Values between 0 and 255.</span>
    <span style="color: #0000FF;">final</span> <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">red</span>;
    <span style="color: #0000FF;">final</span> <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">green</span>;
    <span style="color: #0000FF;">final</span> <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">blue</span>;
    <span style="color: #0000FF;">final</span> <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span>;

    <span style="color: #0000FF;">public</span> <span style="color: #006699;">ImmutableRGB</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">red</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">green</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">blue</span>, <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">name</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>         <span style="color: #036A07;">/** line 2 **/</span>
        check<span style="color: #909183;">(</span>red, green, blue<span style="color: #909183;">)</span>;
        <span style="color: #0000FF;">this</span>.red = red;
        <span style="color: #0000FF;">this</span>.green = green;
        <span style="color: #0000FF;">this</span>.blue = blue;
        <span style="color: #0000FF;">this</span>.name = name;
    <span style="color: #7388D6;">}</span>
    
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Store three 8-bit values in a 32-bit int.</span>
    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">getRGB</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                                                    <span style="color: #036A07;">/** line 3 **/</span>
        <span style="color: #0000FF;">return</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>red &lt;&lt; 16<span style="color: #709870;">)</span> | <span style="color: #709870;">(</span>green &lt;&lt; 8<span style="color: #709870;">)</span> | blue<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">getName</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">return</span> name;
    <span style="color: #7388D6;">}</span>

    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">ImmutableRGB</span> <span style="color: #006699;">invert</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>                                           <span style="color: #036A07;">/** line 4 **/</span>
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ImmutableRGB</span><span style="color: #909183;">(</span>255 - red,
                       255 - green,
                       255 - blue,
                       <span style="color: #008000;">"Inverse of "</span> + name<span style="color: #909183;">)</span>;
    <span style="color: #7388D6;">}</span>
    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">check</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">red</span>,                                              <span style="color: #036A07;">/** line 5 **/</span>
                       <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">green</span>,
                       <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">blue</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>red &lt; 0 || red &gt; 255 || green &lt; 0 || green &gt; 255 || blue &lt; 0 || blue &gt; 255<span style="color: #909183;">)</span> 
            <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">IllegalArgumentException</span><span style="color: #909183;">()</span>;
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4db6cf3" class="outline-3">
<h3 id="org4db6cf3">Zusammenfassung</h3>
<div class="outline-text-3" id="text-org4db6cf3">
<p>
Summary of the main themes in the recent code examples
</p>

<ul class="org-ul">
<li>producer-consumer pattern using a synchronous queue:
<ul class="org-ul">
<li>In effect, a thread-safe channel from one thread to another.
<ul class="org-ul">
<li>Two producers with one consumer to illustrate the thread safety.</li>
<li>The particular queue used in this example acts like a pipe, as there's no buffering.</li>
</ul></li>
</ul></li>
<li>file-searcher: the fork/join framework as a way to 'divide and
conqueur' recursive tasks
<ul class="org-ul">
<li>Java's fork/join framework allows less busy threads from an
executor-service to 'steal' work from busier threads.</li>
<li>Basic pattern: divide the task into subtasks (etc.), and then
aggregate the results.</li>
</ul></li>
<li>semaphores: a resource needs limited access, but not mutual
exclusion
<ul class="org-ul">
<li>The ski rental example provides 'tickets' (a counting semaphore)
to dictate how many ski pairs from inventory may be rented out at
any time</li>
</ul></li>
<li>Asynchronous multithreading using futures: dispatch a task to a
thread, and check later for the result.</li>
<li>Immutable types and 'pure functions' are inherently thread-safe:
<ul class="org-ul">
<li>There's a cost to immutable types, as mutating operations
(write-edit-delete) require that a copy be made&#x2013;and it's the copy
that's changed, not the original.</li>
<li>Pure functions have no side-effects, as they work only with
parameters and local variables, both of which are thread safe. Is
this realistic in real-world programming?</li>
</ul></li>
</ul>

<p>
Options for thread synchronization (including cooperation) using the
GO language
</p>

<p>
&#x2026;
</p>

<p>
vorerst auslassen
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2017-11-01 Wed 19:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>